[
    {
        "title": "Ben 10 Returns, Part 1",
        "stream_url": "https://www.luxubu.review/v/4l900l06nx9",
        "description": "Five years after the original Ben 10 series, a matured 15-year-old Ben Tennyson has removed the Omnitrix and lives a normal high school life. Visiting the Rust Bucket to see his Grandpa Max, Ben finds Max missing and encounters a mysterious alien which flees. Searching the RV, Ben finds a message left by Max claiming that he is investigating renewed alien activity on Earth, and that he has the Omnitrix. Ben confirms that the Omnitrix is still in his bedroom, and deduces that Max was hinting for Ben to put the Omnitrix back on. Ben consults his cousin Gwen, and the two are confronted by Magister Labrid, a Plumber who was aiding Max in his investigation before going missing. They agree to work together to find Max, and Ben puts the Omnitrix back on. The trio ambush an illegal trade between the Forever Knights and a group of the aliens who attacked Ben. During the battle, the Omnitrix recalibrates, giving Ben access to ten new alien forms. Ben is then attacked by his old nemesis Kevin Levin, the broker of the trade, whom he defeats. Kevin reluctantly agrees to help track down the Forever Knights who had fled, and the group travels to a Forever Knight castle, where they encounter a robotic dragon."
    },
    {
        "title": "Ben 10 Returns, Part 2",
        "stream_url": "https://www.luxubu.review/v/pm95pymzp8o",
        "description": "Ben, Gwen, Kevin, and Labrid defeat the robotic dragon and the Forever Knights, but in the process, Labrid is critically wounded. Telling Ben to keep investigating the alien conspiracy and to believe in himself, Labrid dies. Kevin, taking Labrid's Plumber's badge, agrees to continue helping Ben and Gwen. They trace the aliens to a huge underground facility housing a massive spaceship. Gwen concludes that Max was previously in the facility, but left. Ben decides that they need to finish the mission, and they proceed deeper into the facility, where they encounter an army of aliens led by an enormous, virtually invulnerable Highbreed. Ben duels the Highbreed until their spaceship launches, and the Highbreed orders the destruction of the surrounding area to hide their activities. Ben is able to sabotage the ship just before it vaporizes a hospital, and it crashes and explodes in the desert. Ben, Gwen, and Kevin then decide to continue working together to find out what happened to Max."
    },
    {
        "title": "Everybody Talks About the Weather",
        "stream_url": "https://www.luxubu.review/v/pmv5pmpn589",
        "description": "In search of Max's whereabouts, Ben, Gwen, and Kevin receive a Plumber's badge signal and enter the town of Grover's Mill, where local authorities are in pursuit of a Pyronite (the species of Ben's alien Heatblast) who is allegedly burning crop circles with his powers. Ben subdues the Pyronite, who reveals himself as Alan Albright, a half-human; his father was a Pyronite Plumber who gave him his badge to protect him from being arrested for interstellar trespassing. Ben helps Alan escape from the police, and they investigate the crop circles, which Gwen deduces are actually circuit boards spread across the whole valley. They discover that they were created by the aliens they previously fought (known as DNAliens), which activate the circuit boards and cause a huge machine to rise and alter the weather to lower temperatures. Ben and Alan destroy the weather machine, and the sheriff, realizing that Alan was not to blame for the attacks, recruits him to help search for more aliens in the region."
    },
    {
        "title": "Kevin's Big Score",
        "stream_url": "https://www.luxubu.review/v/7qo7nqnw5w9",
        "description": "Kevin meets with an old friend named Argit, who claims he knows the location of a particular piece of alien technology that Kevin is looking for. Needing something to bargain with, Kevin steals Max's RV, the Rust Bucket II, but after seeing the huge amount of Plumber's tech and weapons inside it, Argit double-crosses Kevin and steals the RV for himself. The team follows Argit with a tracking device that Kevin hid on the Rust Bucket's undercarriage and stops Argit, but Kevin storms away to seek out Vulkanus, who is in possession of the alien device. Kevin tries to make a deal with Vulkanus, but the latter forces Kevin to absorb a rare alien crystal called Taedenite, planning to use him as a living gem mine. Ben and Gwen arrive and defeat Vulkanus, and the alien tech Kevin sought is revealed to be a message from Max, who instructs Ben to put together a team of Plumber's children to prepare for what is coming."
    },
    {
        "title": "All That Glitters",
        "stream_url": "https://www.luxubu.review/v/mzok3232019",
        "description": "While Ben obsesses over fulfilling Max's request to find other Plumbers' kids, Gwen and Kevin come at odds over their mutual romantic feelings and Kevin's inaction in asking her out. The team encounters a weakened high school girl who nearly causes a car accident, which is averted by a superpowered boy named Michael Morningstar, who reveals himself as another Plumber's kid. Michael explains that something is causing girls at his school to become zombified monsters, and they agree to investigate together. They find and battle a group of zombie girls, who escape after Michael causes debris to fall between them. Gwen, infatuated with Michael and annoyed with Kevin, agrees to go on a date with him. Kevin, distrusting Michael, convinces Ben to check on her with him, where they find Michael absorbing her powers and turning her into a zombie. Michael is revealed to have been the one zombifying his classmates, stealing their life force for themselves. Gwen is able to defeat Michael, and the girls take their life force back from him, deforming him in the process. Kevin then destroys Michael's Plumber's badge, and Ben apologizes for being too quick to trust Michael."
    },
    {
        "title": "Max Out",
        "stream_url": "https://www.luxubu.review/v/pm95pmpmx8o",
        "description": "Gwen's older brother Ken is missing, and she asks for Ben and Kevin's help to find him. The gang stumbles upon a Highbreed base in a small town called Santa Mira that manufactures Xenocytes, headcrab-style parasites that mutate humans into DNAliens. Ken has been infected by one of the Xenocytes, but Ben is able to remove it with the help of the Omnitrix. With Ken in tow, the gang finds Grandpa Max inside the base. While the team and Ken destroy shipments of Xenocytes, Max sets about destroying the factory while searching for the egg-laying machine. Upon their return, the gang finds Max locked in battle with a Highbreed commander. In an act of self-sacrifice, Max uses an unfocused Null Void projector to destroy the Highbreed base, seemingly killing himself and the Highbreed in the process."
    },
    {
        "title": "Pier Pressure",
        "stream_url": "https://www.luxubu.review/v/dw9r50502po",
        "description": "Gwen convinces Ben to ask out his crush, Julie Yamamoto, on a date to a nearby amusement pier. Meanwhile, an alien spaceship crashes on Earth and releases a small, symbiotic alien which tracks down and attacks Ben. The alien kidnaps Julie and lures Ben to the crashed ship, which Ben finds is on a self-destruct countdown, with a Galvanic Mechamorph (the species of Ben's alien Upgrade) is trapped inside. Ben is able to rescue the Mechamorph, Baz-l, and prevents the ship from exploding. Baz-l explains that the symbiotic Mechamorph, nicknamed \"Ship,\" was sent out in order to find a Plumber to rescue him, and mistook Ben for one due to the Omnitrix. Baz-l repairs the ship and leaves Earth, leaving Ship in Ben and Julie's care. Ben and Julie then walk home together, while Ship flees."
    },
    {
        "title": "What Are Little Girls Made Of",
        "stream_url": "https://www.luxubu.review/v/8xop6565zqv",
        "description": "While Ben, Gwen, and Kevin are taking a break at Max's favorite fishing spot, they see a mysterious cloaked woman leave a flower at the base of a nearby tree. When the team tries to meet her, she disappears. They decide to stake out the area for a while until the woman shows up again. When she appears, Ben and Kevin confront her, and she is revealed to possess magical powers like Gwen's. However, when she sees Gwen use her powers, she is amazed. Gwen's magical powers are revealed to be inherited from the strange woman - Ben and Gwen's long-lost paternal grandmother, Verdona, a powerful energy being called an Anodite. Verdona attempts to convince Gwen to break out of her human body and embrace her full Anodite power, but Gwen refuses. Verdona reluctantly leaves, but promises to return to visit."
    },
    {
        "title": "The Gauntlet",
        "stream_url": "https://www.luxubu.review/v/1lo61l1lrl9",
        "description": "After the team faces off against a Techadon robot, Kevin grabs the severed hand of the robot and places it in his trunk. At night, Ben's childhood bullies J.T. and Cash Murray see Kevin's car outside a restaurant, and decide to wreck it. They push it down a hill, smashing the trunk open. They look inside and grab the Techadon gauntlet before the car's alarm attracts Kevin. Back at their hangout, Cash puts the gauntlet on, planning on using its built-in laser blaster to destroy Ben once and for all and repair their reputation but the full robot armor begins to reform around Cash's body. In doing so, the arm messes with Cash's mind, making him more hostile than usual. Ben fights Cash, and J.T. attempts to reason with him. After remembering his friendship with J.T., Cash's willpower overrides the robot arm, and it gradually reduces in size to the point where Cash can take it off. J.T. and Cash walk away with a newfound respect for Ben."
    },
    {
        "title": "Paradox",
        "stream_url": "https://www.luxubu.review/v/5jo4xkxkdxv",
        "description": "The team gets word of a strange creature roaming around an abandoned desert town named Los Soledad. The creature seems to be aging everything it touches at an accelerated rate. While Ben, Gwen, and Kevin investigate, they see a strange man who seems to be able to disappear at will. After trying to fight him, the team learn that he is Professor Paradox, a scientist who was sucked into the event horizon of his time-travel experiment. Displaced from time and space, Paradox is able to move through time at will. However, the same mistake that rendered him ageless created the creature they seek. After analyzing its movements, they come to the conclusion that its movement is like that of a man desperately attempting to find his way out of a strange town. They realize that it was Paradox's assistant, Hugo, and attempt to travel back in time to prevent him from turning into the creature. As they open a portal and push Hugo away from it, Paradox gets leverage from gumballs, which he claims are unaffected by time, and they are able to place Hugo back into his proper time. Back in the present, the team sees Hugo, and Paradox exchanges pleasantries with him before he departs. Kevin discovers that Paradox fixed his car in the process. Inside, he discovers a note saying that if it were to come into contact with anything from 1976, it would explode like antimatter."
    },
    {
        "title": "Be-Knighted",
        "stream_url": "https://www.luxubu.review/v/40vxm2m21yo",
        "description": "Kevin has arranged a meeting for Ben with the Forever Knights, who need help in slaying a dragon they have kept captive underneath their castle for 1,000 years. After teaming up with the Knights' mightiest warrior, Sir Connor, in a failed attempt to destroy the dragon, Ben notices that the dragon appears to be trying to communicate. The team leaves the Knights behind and tracks the dragon to a warehouse where its spaceship is being held. Ben fits the dragon with a universal translator so it can speak, and it reveals that he is an alien mapmaker, but was captured by the Forever Knights. Ben helps the dragon find its spaceship, and it departs in peace. He then starts to question the motives of the Forever Knights."
    },
    {
        "title": "Plumbers' Helpers",
        "stream_url": "https://www.luxubu.review/v/7qv7nqnqpwo",
        "description": "A pair of rogue half-human Plumbers' kids, a female human-Kineceleran named Helen Wheels, and a male human-Tetramand named Manny Armstrong, have been attacking stray DNAliens and all other aliens they can find, and sucking them into a Null Void projector, believing it to have vaporized them. Believing that the team is DNAliens in disguise, they kidnap Kevin, intending to use him as bait for Gwen and Ben. After his rescue, the two sides work things out. After looking at a database of the aliens they captured and put into the Null Void, Ben realizes that some of them may have been Plumbers' kids. To make things right, the duo set out into the Null Void to rescue those they wrongfully imprisoned."
    },
    {
        "title": "X = Ben + 2",
        "stream_url": "https://www.luxubu.review/v/8gvdeded2po",
        "description": "The Incursean Emperor Milleous's daughter Attea is kidnapped by the bounty hunter Sevenseven. Unless she is returned, Milleous plans to destroy the Earth. The Emperor's majordomo, Raff, seeks out Kevin to help on the search. Using Gwen's powers to track her, they teleport to a nearby dam to rescue her. When the dam is broken, Ben uses the untested Alien X to try to fix it. The task proves simple thanks to Alien X's reality-warping capabilities, but Attea is yet again captured by Sevenseven and Ben finds himself locked in endless debate with the alien's other two personalities, Bellicus and Serena, unable to move or transform back without their consent. Meanwhile, Kevin and Gwen struggle against the Incursean forces attacking them at all sides. Eventually, Ben is able to convince Serena to transform him into Swampfire, and makes quick work of the enemies. The team completes the job successfully, and Milleous informs them that Earth will be spared."
    },
    {
        "title": "Darkstar Rising",
        "stream_url": "https://www.luxubu.review/v/7zo-n0n6r2v",
        "description": "After a Plumber setup to find out if the team has been masquerading as Plumbers, Ben, Gwen and Kevin are forbidden to fight against the Highbreed threat by Plumbers Magister Prior Gilhil. Ghilhil has doubts the Highbreed are even as much of a threat as they claim. Elsewhere, a mysterious powerful new enemy 'employs' a Highbreed to attack the team. Having also tipped off Gilhil, all three are captured by the team's old enemy, Michael Morningstar, now calling himself Darkstar."
    },
    {
        "title": "Alone Together",
        "stream_url": "https://www.luxubu.review/v/8godede3wp9",
        "description": "After an accident with a teleporter pod, Ben and a Highbreed officer named Reinrassic III are stranded on a desert planet called Turrawuste. The pair are forced to work together to fend off the dangerous predators on the planet while making their way to the routing station, much to Reinrassic's chagrin. As they make their way across the desert, the two save each other from danger from the violent native wildlife, even risking their own lives to do so. The night before they reach the routing station, a creature attacks them, severing Reinrassic's right hand. This prompts Ben to transform into Swampfire to reattach it. However, Reinrassic does not take well to this, claiming Ben made him impure. When Ben goes to leave through the portal the next morning, he asks Reinrassic why he is choosing to stay back. Reinrassic says that he is doing so because his Methanosian right hand has rendered him impure by Highbreed standards, and that only pure Highbreed can continue with the invasion."
    },
    {
        "title": "Good Copy, Bad Copy",
        "stream_url": "https://www.luxubu.review/v/7yow0m0nqx9",
        "description": "A Galvan (Grey Matter's race) named Albedo builds his own Omnitrix and is permanently stuck in Ben's human form (since wearing the Omnitrix, Ben's DNA has become a default in the Omnitrix). Desperate to find Ben, Albedo resorts to destroying DNAlien hives and Forever Knight castles, demanding information on the teenage Omnitrix wearer. When Gwen and Kevin hear rumors of Ben causing all that damage without them, they're naturally suspicious of the real Ben, who has been studying for a physics test with Julie the entire time. Gwen and Kevin find \"Ben\" taking out another hive and stop him. When \"Ben\" answers Kevin's questions, his left eye begins to twitch, suggesting that he is lying. The real Ben comes soon after. The fake Ben reveals himself as Albedo, a Galvan, and the creator of the Omnitrix. When he demands the Omnitrix back, his left eye twiches again. Ben, thinking Albedo is a Highbreed, demands that he reveal his face. Albedo tells him this is not possible because he took on Ben's human form due to Ben's DNA being set as a default for the Omnitrix. Albedo transforms into Jetray and flies off to a computer factory, but Gwen tracks him with the mana he leaves behind. When they follow him there, Albedo sticks Gwen and Kevin to a wall with packing foam. Ben and Albedo continuously change forms as they fight. When both their Omnitrixes time out, Albedo makes one final plea to Ben to remove the Omnitrix. When Ben refuses, Albedo reaches out and attempts to punch Ben. As Ben steps aside, his Omnitrix locks with Albedo's. It sends out an energy pulse which turns Albedo's jacket red and his hair white. Azmuth teleports to the facility and tells the group that Albedo was his assistant who helped him build the Omnitrix. Azmuth takes away Albedo's Omnitrix, effectively trapping him in his human form, and sends him to a prison in the Null Void, where he plots his revenge and demands chili fries."
    },
    {
        "title": "Save the Last Dance",
        "stream_url": "https://www.luxubu.review/v/zy9nz3z2l89",
        "description": "Gwen asks Kevin to take her to her school's dance, forcing a clueless Kevin to seek advice from Ben. However, Ben has his own problems as Big Chill is overriding the Omnitrix, and taking over his body with each transformation. Each time it occurs, Ben finds himself lying on a large metal structure which continues to develop each time he ends up there. Despite the fact that Julie helps him take note of his transformation into Jetray, he involuntarily hits the Omnitrix and turns into Big Chill. Ben has no recollection of the second transformation ever happening when Julie tells him in the morning. On the night of the dance, the group finds themselves following Big Chill out to the large metal structure. It bursts open, revealing green goo inside. Several bubbles of goo emerge and inside of them are baby Necrofriggians. Kevin reveals that Necrofriggians reproduce asexually once every eighty years, meaning that it will be unlikely that Ben will ever have to go through this again. Big Chill sends off his children to live on the Necrofriggian homeworld, and Kevin jokingly calls Ben \"Mom\" when he turns back. Seeing that they missed their dance, Gwen and Kevin decide to do so out in the desert."
    },
    {
        "title": "Undercover",
        "stream_url": "https://www.luxubu.review/v/3qo17p7rz2o",
        "description": "After trying to test a broken teleporter pod, the team decides to enlist the help of Cooper Daniels, the young boy who had helped the Tennysons in the past. Upon reaching his home, they discover a video of his capture by the DNAliens. They track him down to the abandoned military base Los Soledad, where Paradox built his time machine. They discover that the Highbreed have erected a cloaking field, built by Cooper over the area, concealing a huge, mysterious arch-shaped device."
    },
    {
        "title": "Pet Project",
        "stream_url": "https://www.luxubu.review/v/6m92pmp2ydo",
        "description": "The Forever Knights scientist Dr. Joseph Chadwick sends Sir Morton to kidnap Ship so that the Forever Knights can use him to mass-produce a fleet of interstellar spacecraft with which to attack the homeworld of the alien dragon that escaped them. Morton attacks Ship, capturing the small alien. Ben arrives too late, and the team sets out to find the Knights. Assuming that the Knights have something to do with a medieval-themed track of houses, the team, joined by Julie, attempt to sneak into the main house to rescue Ship."
    },
    {
        "title": "Grounded",
        "stream_url": "https://www.luxubu.review/v/7yvw0m0n-xo",
        "description": "While fighting one of the Highbreed, Ben's parents catch him transforming into Swampfire. Seeing as he comes home with a black eye, they forbid him from using the Omnitrix for fear of him getting hurt. With Gwen and Kevin on the trail of a Highbreed plot, Ben tries to sneak out of the house as Echo Echo. Once Ben's parents see that he disobeyed their orders, they ground him. His various attempts to aid his allies by phone and by computer only results in Ben being forced to tell his parents about Gwen helping him, resulting in her suffering the same fate as her cousin, and leaving Kevin alone to find out what the Highbreed are up to, but later at the ship battling with Highbreed Ben's parents are proud of him because Ben is the only one who can save the world and knows what he's doing and they allow Ben to continue to protect the world."
    },
    {
        "title": "Voided",
        "stream_url": "https://www.luxubu.review/v/yxo3kmk14qv",
        "description": "Helen and Manny use Gwen's powers to call on Ben's team to help deal with a dangerous foe in the Null Void: D'Void. Ben goes in alone, with Kevin and Gwen waiting on the other side to bring him back. Once inside, Ben is shocked to learn that \"D'Void\" is really Dr. Animo, who has taken control of the Null Guardians and enslaved the inhabitants of the Null Void. Ben later encounters Grandpa Max, who was transported to the Null Void in \"Max Out\" and has been leading a resistance movement under the name of \"The Wrench\"."
    },
    {
        "title": "Inside Man",
        "stream_url": "https://www.luxubu.review/v/409xm2mx-yv",
        "description": "The team rescues a young man named Tyler, who stole the Oscillator Key for the Highbreed's hyperspace gateway from Los Soledad. He crashed the truck and suffered memory loss as he escaped. After being almost captured by the DNAliens in a small town, the team saves him and are forced to race the DNAliens to track down the device, resulting in a battle. The team is victorious, but they discover that Tyler is actually a DNAlien, having managed to resist the Xenocyte controlling him, and only looked human through the use of an ID Mask."
    },
    {
        "title": "Birds of a Feather",
        "stream_url": "https://www.luxubu.review/v/549yp4pr8x9",
        "description": "An Arachnichimp (Spidermonkey's race), Simian, needs help in retrieving a crystal which is supposedly the symbol of the monarchy on his planet. Ben offers his help, but Kevin and Gwen are skeptical. In the midst of the battle, Ben discovers that Simian has been lying, and that the crystal is actually powering an intergalactic communications station. By stealing it, Simian will prevent Earth from calling for help against the Highbreed invasion."
    },
    {
        "title": "Unearthed",
        "stream_url": "https://www.luxubu.review/v/809e5g54379",
        "description": "A DNAlien mining operation under Los Soledad uncovers an alien spacecraft, from which a large alien creature is released. It wanders around the nearby town collecting random items, eventually attracting the attention of Ben, Gwen, and Kevin. After a short battle, they realize that the alien is in fact a baby girl. The alien perceives Gwen as an Anodite and hangs on her every word. Needing to return the baby to her parents, the team follows her back to her ship."
    },
    {
        "title": "War of the Worlds, Part 1, Part 2",
        "stream_url": "https://www.luxubu.review/v/2wvm7k7zplv",
        "description": "Paradox and Azmuth arrive on Earth to warn Ben of the approaching Highbreed fleet. Gwen and Kevin gather all the allies they've met to counter the threat. Meanwhile, Azmuth reveals to Ben that the Omnitrix contains the DNA of every sentient species in the galaxy, 1,000,910 in total, and unlocks the Master Control so Ben can effectively combat the Highbreed.\n\nThe team has to get to the captain of the fleet, on the Highbreed head ship to stop the invasion. Ben, Gwen and Kevin quickly head to the captain of the fleet. The Highbreed commander and the team fight. The trio is then surrounded by a group of DNAliens, but are saved by Grandpa Max, Pierce, Helen, Manny, and one Null Guardian, who have regained control over the Null Void. Ben, Gwen, Kevin, Azmuth, and Ship as a spaceship head to the Highbreed's homeworld of Augstaka to confront the Highbreed Supreme after the commander tells them that he is the only one who can call off the war. When they get to Augstaka, they are captured. Ben escapes his confinement by transforming into Humungousaur. The team breaks out and confronts the Highbreed Supreme in person. Ben uses the Omnitrix to detect genetic damage in all the Highbreed. It sends out a pulse which attaches Omnitrix alien DNA to every Highbreed. The Highbreed Supreme is disgusted by Ben's action, and considers mass suicide as the species' only dignified exit. Before he can follow through, Reinrassic III comes in and tells the Highbreed Supreme that this genetic recombination has allowed their species to survive. Reinrassic, whose Methanosian DNA has grown further up his right arm, is otherwise unaffected by the genetic recombination. Seeing Reinrassic's firsthand knowledge of introducing additional DNA, the Highbreed Supreme steps down and names Reinrassic the new Highbreed Supreme. With this, Ben asks Reinrassic to call off the war, which he does. The two shake hands before they depart. Back on Earth, Gwen tells everyone that Darkstar escaped, to which Ben replies that they will find him later. Ben discovers that the Master Control got shut off. When he asks Azmuth how to turn it back on, Azmuth smiles and tells him to have fun figuring it out. He teleports away, leaving Ben free to try out a new alien that just emerged."
    },
    {
        "title": "Vengeance of Vilgax, Part 1",
        "stream_url": "https://www.luxubu.review/v/4lv00l0lyxv",
        "description": "Vilgax begins by winning a Conqueror's Challenge and drains the powers of the champion who he defeats. He then heads to Earth in an attempt to get revenge on Ben. Meanwhile, Ben is seen acting more arrogant as he receives another medal for saving the universe, and is shown to have received many of them. He shows up late to a mission and Gwen and Kevin are angry at him. Psyphon shows up on Earth and summons Vilgax, who defeats Max and the other Plumbers. Kevin attempts to hack the Omnitrix despite a warning from Azmuth but is transformed into a combination of different metals and some of Ben's aliens escape the Omnitrix."
    },
    {
        "title": "Vengeance of Vilgax, Part 2",
        "stream_url": "https://www.luxubu.review/v/8xvp135rqv7",
        "description": "Ben begins by recapturing the lost aliens of Chromastone, Spidermonkey, and Goop before taking on Vilgax. However, despite trying to use Jetray, Big Chill, and Humongusaur he is unable to defeat Vilgax. Gwen and Kevin show up with Way Big, who Ben scans and attempts to transform into, but he becomes Chromastone instead. Vilgax smashes Chromastone and Psyphon picks up the Omnitrix, but then Ben reappears as Diamondhead and defeats Vilgax, saving the Earth."
    },
    {
        "title": "Inferno",
        "stream_url": "https://www.luxubu.review/v/4lo00l0lexo",
        "description": "Ben, Gwen, and Kevin discover that Vulkanus is planning to drill to the Earth's center."
    },
    {
        "title": "Fool's Gold",
        "stream_url": "https://www.luxubu.review/v/8g9z6363gyv",
        "description": "An alien asks Ben to help locate his missing best friend."
    },
    {
        "title": "Simple",
        "stream_url": "https://www.luxubu.review/v/pm95pmpm68o",
        "description": "Ben and the team travel to an alien planet to resolve a conflict between the inhabitants. Kevin finds that Argit has been selling the weapons from one side to the other after painting them a different color. A temporary truce occurs, but as Ben attempts to shake hands with the leaders of each side, one side takes offense and the war restarts. Then Ben kidnaps the leaders of each side to attempt to force another truce, but they escape after blinding Ben with a flashlight. Ben transforms into Way Big and accidentally breaks a statue of the planet's former leader. With both sides fighting and angry at Ben, he flees the planet."
    },
    {
        "title": "Don't Fear the Repo (Vreedle, Vreedle)",
        "stream_url": "https://www.luxubu.review/v/54oyp4p43xo",
        "description": "Ben and Kevin try to thwart repo-men sent to return Ship to his maker and appeal to a judge to rescind his ruling."
    },
    {
        "title": "Singlehanded",
        "stream_url": "https://www.luxubu.review/v/80oe5g5g87o",
        "description": "A bounty hunter who's after the Omnitrix sends Ben to the Null Void, but his left hand remains on Earth."
    },
    {
        "title": "If All Else Fails",
        "stream_url": "https://www.luxubu.review/v/05ol1k1kdn9",
        "description": "Ben, Gwen, Max and Kevin have to thwart a Highbreed failsafe, which gets accidentally set off."
    },
    {
        "title": "In Charm's Way",
        "stream_url": "https://www.luxubu.review/v/80ve5g5gq7v",
        "description": "Charmcaster returns and gets Kevin to help her to defeat Gwen."
    },
    {
        "title": "Ghost Town",
        "stream_url": "https://www.luxubu.review/v/yx93kmkmwqo",
        "description": "Vilgax asks for Ben's help to take down Zs'Skayr who has taken over his planet."
    },
    {
        "title": "Trade-Off",
        "stream_url": "https://www.luxubu.review/v/pmo5pmpmq8v",
        "description": "Kevin teams up with Darkstar to retrieve an artifact that could cure both of them."
    },
    {
        "title": "Busy Box",
        "stream_url": "https://www.luxubu.review/v/05vl1k1k-no",
        "description": "Ben, Gwen and Kevin battle an alien's toy which proves to be very dangerous."
    },
    {
        "title": "Con of Rath",
        "stream_url": "https://www.luxubu.review/v/dwor5050dpv",
        "description": "The Omnitrix malfunctions, turning Ben into a ruthless and aggressive alien while on an intergalactic peace mission."
    },
    {
        "title": "Primus",
        "stream_url": "https://www.luxubu.review/v/80ve5g5g07v",
        "description": "Ben, Gwen and Kevin get transported by the Omnitrix to a strange new planet where they encounter Vilgax."
    },
    {
        "title": "Time Heals",
        "stream_url": "https://www.luxubu.review/v/pmv5pmppz89",
        "description": "Gwen goes back in time to stop the Omnitrix experiment from ever happening while causing disasters in the present time."
    },
    {
        "title": "The Secret of Chromastone",
        "stream_url": "https://www.luxubu.review/v/5jv4xkxkrx9",
        "description": "A sick Ben is happy to see an old friend Tetrax but finds out he has plans of his own."
    },
    {
        "title": "Above and Beyond",
        "stream_url": "https://www.luxubu.review/v/8x9p65661qo",
        "description": "The Plumbers' Helpers travel to a Plumber station to rescue Max from an insane, rampaging Ben."
    },
    {
        "title": "Vendetta",
        "stream_url": "https://www.luxubu.review/v/3qv17p7762v",
        "description": "Kevin decides to settle old scores with an escaped con."
    },
    {
        "title": "The Final Battle, Part 1",
        "stream_url": "https://www.luxubu.review/v/8g9dedee1pv",
        "description": "Vilgax and Albedo return and team up to kidnap Kevin and Gwen so that they can take down Ben."
    },
    {
        "title": "The Final Battle, Part 2",
        "stream_url": "https://www.luxubu.review/v/05ol14k31n9",
        "description": "Ben gives up the Omnitrix and overcomes seemingly impossible odds to defeat Vilgax, who has betrayed Albedo."
    }
]