[
    {
        "title": "The More Things Change, Part 1",
        "stream_url": "https://www.luxubu.review/v/p6vg77lp5xv",
        "description": ""
    },
    {
        "title": "The More Things Change, Part 2",
        "stream_url": "https://www.luxubu.review/v/1lo611qkql9",
        "description": ""
    },
    {
        "title": "A Jolt from the Past",
        "stream_url": "https://www.luxubu.review/v/4lv0003xdxv",
        "description": ""
    },
    {
        "title": "Trouble Helix",
        "stream_url": "https://www.luxubu.review/v/zy9nzzd4n89",
        "description": ""
    },
    {
        "title": "Have I Got a Deal for You",
        "stream_url": "https://www.luxubu.review/v/dwor55q34pv",
        "description": ""
    },
    {
        "title": "It Was Them",
        "stream_url": "https://www.luxubu.review/v/6m92ppd2jdo",
        "description": ""
    },
    {
        "title": "So Long, and Thanks for All the Smoothies!",
        "stream_url": "https://www.luxubu.review/v/8gvz66dp5yo",
        "description": ""
    },
    {
        "title": "Hot Stretch",
        "stream_url": "https://www.luxubu.review/v/409xmm3x5yv",
        "description": ""
    },
    {
        "title": "Of Predators and Prey, Part 1",
        "stream_url": "https://www.luxubu.review/v/1l9611qnjlv",
        "description": ""
    },
    {
        "title": "Of Predators and Prey, Part 2",
        "stream_url": "https://www.luxubu.review/v/549ypp6r5x9",
        "description": ""
    },
    {
        "title": "Outbreak",
        "stream_url": "https://www.luxubu.review/v/mz9k33w4-1v",
        "description": "While Khyber struggles to control his dog's transformations, Dr. Psychobos tells Malware that he will need a part of the Omnitrix to fix it. This causes Dr. Psychobos to infiltrate the Plumber's base on Earth and steal a part from Ben's Omnitrix, causing it to malfunction. The malfunctioning of the Omnitrix causes its powers to leak into Psyphon, Bubble Helmet, Fistina, and Liam, giving them abilities similar to the Omnitrix aliens."
    },
    {
        "title": "Many Happy Returns",
        "stream_url": "https://www.luxubu.review/v/yxv3kkr1jq9",
        "description": "Gwen and Kevin pay Ben a surprise visit, while a Tetramand princess (Kimberly Brooks) and her father's fleet of warships threaten the Earth."
    },
    {
        "title": "Gone Fishin'",
        "stream_url": "https://www.luxubu.review/v/7z9-nn86r2o",
        "description": "Magister Patelliday is captured by pirates."
    },
    {
        "title": "Blukic & Driba Go to Mr. Smoothy's",
        "stream_url": "https://www.luxubu.review/v/1xoqqqznlxo",
        "description": "Ben and Rook must stop Trumbipulor (Bauza) from gaining absolute power. Meanwhile, Blukic and Driba set out to find a Mr. Smoothy's after seeing an advertisement for their new grasshopper smoothies and have many misadventures along the way with one of them tying into fighting Trumbipulor's robotic rats."
    },
    {
        "title": "Malefactor",
        "stream_url": "https://www.luxubu.review/v/4lo00036kxo",
        "description": "Ben and Rook are attacked by Khyber and his dog at the Old Bellwood Days Festival. In a flashback, it is also revealed how Malware obtained his current mutated form."
    },
    {
        "title": "Arrested Development",
        "stream_url": "https://www.luxubu.review/v/pm95ppzn78o",
        "description": "An old rival of Ben Tennyson named Billy Billions (Aziz Ansari) turns Ben and Rook into kids again while bringing Dimension 12 robots to Earth and controlling them."
    },
    {
        "title": "Bros in Space",
        "stream_url": "https://www.luxubu.review/v/05ol1136ln9",
        "description": "Ben and Rook visit Rook's family during the Amber Ogia harvest, while Fistrick trains the planet's local rodents to steal the Amber Ogia as fuel for his planet-destroying satellite."
    },
    {
        "title": "Ben Again",
        "stream_url": "https://www.luxubu.review/v/pmv5ppznj89",
        "description": "Eon (Judd Nelson) returns and switches Ben's mind with his younger self as part of a plot to take over the timelines. It's up to Paradox, and the two Gwens from the past and present, to help the Bens regain their rightful minds and help to defeat Eon."
    },
    {
        "title": "Store 23",
        "stream_url": "https://www.luxubu.review/v/54oypp6rqxo",
        "description": "Ben takes Blukic and Driba to look for the 23rd Mr. Smoothy restaurant. After Ben, Blukic, and Driba enter the 23rd Mr. Smoothy restaurant, they find it run by Professor Blarney T. Hokestar who is using a dimensional device to move the restaurant to different dimensions. In one dimension, Ben meets an alternate version of himself (Tara Strong) who is very rich, names his aliens differently, and has lost his beloved Grandpa Max."
    },
    {
        "title": "Special Delivery",
        "stream_url": "https://www.luxubu.review/v/6mo2ppd2ydv",
        "description": "After Ben accidentally destroys Mr. Baumann's car during his fight with Psyphon's minion, Thunderpig, Mr. Baumann orders Ben to make deliveries for him without using the Omnitrix. When Ben unknowingly gets the Dwarf Star (a massive power source that was going to be sold at Psyphon's auction) in his possession, Ben must fight off Pysphon, Fistina, Zombozo, Trumbipulor, the Vreedle Brothers, Fistrick, Vulkanus, Sunder, and Seebik to keep them from getting absolute power."
    },
    {
        "title": "Showdown, Part 1",
        "stream_url": "https://www.luxubu.review/v/zyvnzz82k8v",
        "description": "The Faction infiltrates a Galvan museum and try to take Azmuth (René Auberjonois), but instead teleport Ben and Rook to the museum. Khyber and Dr. Psychobos have a fight and Zed turns into Vicetopus and takes Dr. Psychobos. Ben reveals when he was 11, he had a fight with Malware and he took Feedback out from the Omnitrix and killed him. Angered, Ben puts his Omnitrix into Malware and he seemingly perished from the overload. Khyber takes the Nemetrix from Zed and mysteriously escapes. The group arrests Dr. Psychobos, who warns Azmuth that the planet and his species are about to become extinct. Galvan Prime's moon, Galvan B, explodes with everyone shocked and surprised."
    },
    {
        "title": "Showdown, Part 2",
        "stream_url": "https://www.luxubu.review/v/5jo4xx3n6xv",
        "description": "Galvan Prime's ecosystem is engulfed by Malware and Galvan Prime is destroyed. A gigantic Malware then accumulates on the surface of Galvan. Ben is absorbed into Malware and confronts his 11-year-old counterpart. They both forgive each other for the incident with Malware and 16-year-old Ben regains Feedback. There is a shower of mechamorphs leading to Malware becoming its original size. Malware is finally defeated and destroyed by Feedback, and Kevin ends up adopting Khyber's dog."
    },
    {
        "title": "Tummy Trouble",
        "stream_url": "https://www.luxubu.review/v/pm95pp4n58o",
        "description": "The Gourmand Queen (April Winchell) is captured by Incurseans, forcing Ben and Rook to rally her feuding subjects to save her."
    },
    {
        "title": "Vilgax Must Croak",
        "stream_url": "https://www.luxubu.review/v/05ol11y6pn9",
        "description": "Ben and Rook escort Vilgax (Steve Blum) to a maximum-security prison planet, but the Incurseans have other plans."
    },
    {
        "title": "While You Were Away",
        "stream_url": "https://www.luxubu.review/v/1xoqqq4n-xo",
        "description": "Princess Attea (Strong) springs Dr. Psychobos from prison to help her invade Revonnah."
    },
    {
        "title": "The Frogs of War, Part 1",
        "stream_url": "https://www.luxubu.review/v/54oypprmgxo",
        "description": "The Incurseans take control of Earth, so Rook and the Plumbers must stop them, while Ben is somehow missing."
    },
    {
        "title": "The Frogs of War, Part 2",
        "stream_url": "https://www.luxubu.review/v/80oe55k437o",
        "description": "Ben, Rook, Gwen, and Kevin must find a solution to stop the Incurseans once and for all."
    },
    {
        "title": "Rules of Engagement",
        "stream_url": "https://www.luxubu.review/v/7q97nnwypwv",
        "description": "Princess Looma attacks Ester's village, forcing Ben, Rook, Fistina and Julie to stop her. In the meantime, Ben is shocked as Julie has gotten a new boyfriend."
    },
    {
        "title": "Rad",
        "stream_url": "https://www.luxubu.review/v/54oyppkr8xo",
        "description": "With Plumber agents trapped in Incursean territory, Ben and Rook must employ the services of Rad Dudesman (Carlos Alazraqui), the roughest, toughest smuggler in the galaxy."
    },
    {
        "title": "Evil's Encore",
        "stream_url": "https://www.luxubu.review/v/2w9m77xz1l9",
        "description": "Dr. Animo remembers the time he had taken control of the Plumbers Headquarters inside Mount Rushmore, planning to mutate everyone on Earth into grotesque, monstrous creatures resembling him."
    },
    {
        "title": "T.G.I.S.",
        "stream_url": "https://www.luxubu.review/v/7qv7nnd3lwo",
        "description": "The Secret Saturdays (Ogie Banks, Vanessa Marshall, Corey Burton, & Robinson) come to Bellwood to investigate a rash of chupacabra attacks. Ben and Rook assist, finding the chupacabras have been draining aliens of their lifeforce. They soon discover that the chupacabras are being controlled by Dr. Animo, who is an old business associate of V.V. Argost. Using the alien lifeforce, Animo successfully revives Argost in a mismatched hybrid body. Now Ben, Rook, and the Saturdays must work together to turn the tables on the alliance of Dr. Animo and V.V. Argost when they plan to make an army of \"Franken-Cryptids.\""
    },
    {
        "title": "Food Around the Corner",
        "stream_url": "https://www.luxubu.review/v/4lo000e43xo",
        "description": "Ben as Gravattack attempts to moderate a peace treaty between the Lewodons (Dee Bradley Baker & Bauza) and the Appoplexians (Jim Cummings & Kaye), but must endure the attacks of tiny alien fleas which have inhabited his body. Rook shrinks down in attempt to get the fleas off him before the peace treaty is ruined. But it turns out that the Lewodon named Poltroon, sent the fleas onto Gravattack to destroy his core, causing a meltdown in attempt to destroy both the Lewodons and the Appoplexians, therefore causing a war between the two species and taking power to destroy his enemies. Now Rook must find a way to change Ben back before they are destroyed and to stop Poltroon."
    },
    {
        "title": "O Mother, Where Art Thou?",
        "stream_url": "https://www.luxubu.review/v/80oe5540-7o",
        "description": "Octagon and Rhomboid Vreedle decide to prove themselves to Ma Vreedle (Diane Delano) by pulling off successful crimes; to ensure success in numbers, they take a Pretty Boy Vreedle to assist them under the belief that Ma won't notice one out of the several others missing. When Ma does discover this, she threatens to blow up the sun if the Plumbers don't find Pretty Boy. Meanwhile Ben tries to hide from his mom so he won't get seconds on the dinner that he hates."
    },
    {
        "title": "Return to Forever",
        "stream_url": "https://www.luxubu.review/v/05ol11g58n9",
        "description": "The Forever Knights are back, and plan to erase all alien DNA on Earth with Will Harangue's (DiMaggio) help. After the Forever Knights are taken care of, Ben might have a fitting punishment in mind for Harangue."
    },
    {
        "title": "Mud Is Thicker Than Water",
        "stream_url": "https://www.luxubu.review/v/8godee501p9",
        "description": "While Rook and Kevin are at an auto show, Ben, Gwen, and cousin Lucy try to find out how Psyphon's thugs are getting Level 7 Plumber technology. Gwen suspects that Lucy (Strong) is the mole because of her shapeshifting abilities as a Sludgepuppy and love of tricks when she was younger, but it turns out that it is an old enemy: Gorvan."
    },
    {
        "title": "OTTO Motives",
        "stream_url": "https://www.luxubu.review/v/3q9177y2029",
        "description": "While attending an intergalactic auto show on Khoros, Kevin, Rook and Argit run into OTTO (Kevin Schon), an old enemy of Kevin and Argit that stranded them alone in the Null Void. But OTTO and Violent Offenders end up stealing some of the most expensive cars, and OTTO turns into a giant robot, leaving Ben having to stop him."
    },
    {
        "title": "The Ultimate Heist",
        "stream_url": "https://www.luxubu.review/v/80oe55lrm7o",
        "description": "Albedo (disguised as Ben) (Lowenthal) seeks a device that will finally change him back into his Galvan form. Meanwhile, Ben (disguised as Albedo by Khyber) is locked in Plumber HQ prison. It reveals Khyber has disguised Ben and Albedo as each other for their plan to work. Meanwhile Argit claims to be the hero of Undertown after stopping the Way Bads in \"The Frogs of War\"."
    },
    {
        "title": "A Fistful of Brains",
        "stream_url": "https://www.luxubu.review/v/54oyppwl1xo",
        "description": "After Ben falls for Albedo's trap, Grandpa Max and Rook search all over the galaxy looking for Ben. Meanwhile he's been secretly trapped on Khyber's hidden personal hunting preserve fighting Khyber's new pet that now wears the Nemetrix. But as Ben finds a way out, he has to deal with Albedo. When Grandpa Max and Rook arrive, they find that Albedo and Khyber have Azmuth as their captive."
    },
    {
        "title": "For a Few Brains More",
        "stream_url": "https://www.luxubu.review/v/7zo-nnqmk2v",
        "description": "Albedo took out Azmuth's brain through his cerebral vortex. With assistance from Gwen and Kevin, Ben, Rook, Max and Azmuth and the Plumbers must find a way off Khyber's Place, to get back to Earth and stop Albedo and Khyber from taking over the galaxy by absorbing Azmuth's brain."
    },
    {
        "title": "Max's Monster",
        "stream_url": "https://www.luxubu.review/v/5jv4xx40yx9",
        "description": "Ben, Rook, and Max have their hands full when Phil (Paulsen) returns as a human-Terroranchula hybrid as a side effect of using the Nemetrix five years ago, and starts absorbing all of the electricity in Bellwood. But when he heads into Undertown's mini power-plant and starts to absorb the Megawatts, they must find a way to stop him."
    },
    {
        "title": "Something Zombozo This Way Comes",
        "stream_url": "https://www.luxubu.review/v/8godee50pp9",
        "description": "Ben and Rook investigate a circus, which Ben decides to stay out of while Rook enjoys the show; however, he comes out looking like a clown. Ben gets him to Plumber HQ, suspecting that Zombozo is up to his old tricks; however, Zombozo has escaped his cell and the number of zombie clowns is growing. Now Ben must try to overcome his fear of clowns to save the people of Bellwood."
    },
    {
        "title": "Mystery, Incorporeal",
        "stream_url": "https://www.luxubu.review/v/2w9m77-5wl9",
        "description": "After Gwen as Lucky Girl beats Punchinello, Ben and Rook visit her and Kevin at college, but Darkstar (Wil Wheaton) gets revenge by using Charmcaster's rock monsters, and creates a cult to use Gwen to open up a portal to Ledgerdomain to absorb all the mana to become even powerful."
    },
    {
        "title": "Bengeance Is Mine",
        "stream_url": "https://www.luxubu.review/v/dw9r55gwepo",
        "description": "Bill Gacks (Blum), an human plumber who resembles Vilgax, accidentally activates a weapon Vilgax set to attack Bellwood while fixing Pakmar's plumbing in Undertown. When Psyphon returns, he believes Bill is Vilgax, and pledges to help him destroy Bellwood. Meanwhile Ben and Rook try to stop Vilgax's squid monsters that the weapon accidentally released."
    },
    {
        "title": "An American Benwolf in London",
        "stream_url": "https://www.luxubu.review/v/4lo000e46xo",
        "description": "Ben's childhood crush, Kai Green (Bettina Bush), asks Ben and Rook for help when her grandfather (Miguel Nájera) is kidnapped by the Forever Knights, who are after a mysterious sword hidden in London."
    },
    {
        "title": "Animo Crackers",
        "stream_url": "https://www.luxubu.review/v/2w9m77-5zl9",
        "description": "Dr. Animo from the future returns to the present to break his past self out of prison, and to steal something from the SACT (Lowenthal) so that they can populate and rule the Earth with mutant animals. In order for Ben and Rook to stop him, they get assistance of someone from the future currently known as Chrono-Spanner."
    },
    {
        "title": "Rad Monster Party",
        "stream_url": "https://www.luxubu.review/v/1xoqqqg5nxo",
        "description": "Ben, Rook, Rad, and Hobble fly through the Anur System to deliver something before they end up crashing into Anur Transyl, needing a device to powe rup their engine. But as they walk through the planet, due to Anur Transyl being all but closed to the rest of the universe, the Halloweenish residents see Ben and his group as the monsters. Ben learns that Zs'Skayr (Ghostfreak's real name) (Blum) has orchestrated the delivery to bring himself and Dr. Viktor (Michael Dorn) back to their home system with revenge as an added bonus."
    },
    {
        "title": "Charmed, I'm Sure",
        "stream_url": "https://www.luxubu.review/v/05ol11g56n9",
        "description": "Still stranded on Anur Transyl, Ben suffers from a serious zit problem that grows worse each time he uses the Omnitrix. At the same time, Charmcaster proposes an alliance to defeat Zs'Skayr, since he stole the Alpha Rune from her. Also, a female Trasylian alien named Viktoria develops a crush on Ben, due to his terrible acne."
    },
    {
        "title": "The Vampire Strikes Back",
        "stream_url": "https://www.luxubu.review/v/pm95pp6rn8o",
        "description": "Zs'Skayr and his allies awaken Lord Transyl (Kaye), where he asks to make an alliance to rule the universe, but just as they team up, they manage to hypnotize everyone on Anur Transyl, and Ben's team. Now with Ben's newest alien Whampire, Ben and Hobble must discover a way to defeat Lord Transyl, save everyone, and fix their ship to get back to Earth."
    },
    {
        "title": "Catfight",
        "stream_url": "https://www.luxubu.review/v/8godee503p9",
        "description": "As Ben and Rook go on a double date with Ester and Rayona (Rook's girlfriend back home), they encounter Nyancy Chan, who places Ben under her trance and uses him in a crime spree. Meanwhile, Princesses Looma and Attea are at odds about who will get to legally marry Ben's alien forms: Four Arms and Bullfrag."
    },
    {
        "title": "Collect This!",
        "stream_url": "https://www.luxubu.review/v/dw9r55gwnpo",
        "description": "Ben meets the ones responsible for his intergalactic TV show and the crew who makes this Ben 10 actor more famous than Ben himself. With Ben frustrated with this show on the air and taking his fame, Simian ends up hiring an alien collector known as Collectimus (Adler) who turns things into training cards for his collection."
    },
    {
        "title": "And Then There Were None",
        "stream_url": "https://www.luxubu.review/v/5jo4xxl85xv",
        "description": "Eon and Vilgax team up and bring together a team of evil-parallel Bens, (consisting of Albedo, the black haired \"Bad Ben\", the Australian-accented warlord Mad-Ben, the deformed, zombie-like Benzarro and the apathetic, gothic Nega-Ben) who go after a Ben who never got an Omnitrix (No Watch Ben). Professor Paradox helps Ben Prime (the main Ben) to find a team of good Bens (consisting of Ben 23, 10-year-old \"Gwen 10\" from a timeline where she got the Omnitrix and Ben Prime's future self, Ben 10,000) to fight back and save No Watch Ben. However, things take a turn for the worse when Vilgax uses a Chronosapien time bomb to wipe out Ben in every other dimension apart from No Watch Ben. Before disappearing, Ben Prime gives his Omnitrix to No Watch Ben."
    },
    {
        "title": "And Then There Was Ben",
        "stream_url": "https://www.luxubu.review/v/1xoqqqj20xo",
        "description": "No Watch Ben and Professor Paradox return to the point where Ben Prime first acquired the prototype Omnitrix six years ago. From there the two start to unite the good Bens to fight Vilgax and the evil Bens. After the team is put together, Paradox sends the other Tennysons who had their watches to fight and keeps No Watch Ben in the event horizon. After Vilgax destroys the multiverse, No Watch Ben returns to fight him and turns into Clockwork to undo the multiverse wipeout. Clockwork sends the Evil Bens back to their respective timelines, then returns the Omnitrix to Ben Prime, and the Good Bens and Gwen take turns beating Vilgax."
    },
    {
        "title": "The Vengers",
        "stream_url": "https://www.luxubu.review/v/8g9z66jr0yv",
        "description": "Billy Billions seeks the help of Mazuma (Strong), Will Harangue, Kangaroo Kommando (Burton), and Captain Nemesis (Christopher McDonald) to form the team The Vengers to take down Ben, make him look bad in front of all of Bellwood, and claim the title as the protectors of Bellwood."
    },
    {
        "title": "Cough It Up",
        "stream_url": "https://www.luxubu.review/v/2w9m77mr4l9",
        "description": "With Spanner's unexpected return, Ben and Rook think Jimmy Jones is Spanner because they never appear at the same time. Meanwhile Argit holds a weapon that can create Techadons with the use of water, and Psyphon and his Bounty Hunters are after the weapon, but when Argit swallows it, they have to tell Argit to \"cough it up\" or he won't stop puking up armies of Techadons."
    },
    {
        "title": "The Rooters of All Evil",
        "stream_url": "https://www.luxubu.review/v/8xop66lkdqv",
        "description": "The Rooters, the Black Ops wing of the Plumbers from the Null Void, head to the Plumbers' Base, looking for Kevin for his property-absorbing powers. Ben sneaks out to get Kevin, who claims to not know the Rooters, but after a run in with their leader, Proctor Servantis (Alder), he begins to recollect hidden memories."
    },
    {
        "title": "Blukic and Driba Go to Area 51",
        "stream_url": "https://www.luxubu.review/v/4dojzz175y9",
        "description": "An old friend of Blukic and Driba asks them to get back a powerful weapon needed to stop an old villain who is attacking Area 51. But with the weapon hidden back in Area 51, Ben and the team must go retrieve it before this strange threat can retrieve the weapon."
    },
    {
        "title": "No Honor Among Bros",
        "stream_url": "https://www.luxubu.review/v/7zo-nnpem2v",
        "description": "Rook is under the influence of Fistrick's \"bro\" essence, and starts to act like a bro. He and Ben infiltrate an alien fight club to claim the Golden Fist."
    },
    {
        "title": "Universe vs. Tennyson",
        "stream_url": "https://www.luxubu.review/v/env8mmx8409",
        "description": "Ben gets dragged into intergalactic court by the other Celestialsapiens for recreating the universe in \"So Long and Thanks for All the Smoothies!\". In the end, the court rules in Ben's favor that Alien X was not controlled by Ben but by Bellicus and Serena."
    },
    {
        "title": "Weapon XI, Part 1",
        "stream_url": "https://www.luxubu.review/v/80ve557wr7v",
        "description": "Kevin and Argit attempt to warn the amalgam kids about the Rooters' intentions before they can hunt them. Kevin gathers Alan (Robinson), and Gwen, Ben, and Rook gather Helen and Manny (Juliet Landau & Khary Payton). The Amalgam kids learn they aren't plumber hybrids, and Kevin goes out into the Null Void alone to put an end to the Rooters, but when Ben and the gang bring the Amalgam Kids, it turns them against Ben, and later Proctor (head of the Rooters) ends up persuading Kevin into joining his side to take down Ben."
    },
    {
        "title": "Weapon XI, Part 2",
        "stream_url": "https://www.luxubu.review/v/8goz66jrly9",
        "description": "After the Rooters have turned Kevin and the amalgam kids against Ben, they attend to hunt after him while Ben, Gwen, Rook, Argit, and Zed try to escape the Null Void."
    },
    {
        "title": "Clyde Five",
        "stream_url": "https://www.luxubu.review/v/2wom77mr5lo",
        "description": "Ben's country cousin Clyde Fife (Jon Heder) wants to become a hero like Ben."
    },
    {
        "title": "Rook Tales",
        "stream_url": "https://www.luxubu.review/v/1xvqqqj25xv",
        "description": "Master Kundo (Jeff Bennett), Rook's former teacher, is willing to save Revonnahgander traditions at any cost by preventing Rook's sister, Rook Sharr from going to the Plumber Academy so she wouldn't be able to become a Plumber."
    },
    {
        "title": "Charm School",
        "stream_url": "https://www.luxubu.review/v/8gvdee6-0po",
        "description": "Charmcaster attacks Gwen at Friedkin University to obtain Hex's mystical Staff of Ages, while Kevin and Rook try to make Kevin's car completely indestructible so that nothing can destroy it."
    },
    {
        "title": "The Ballad of Mr. Baumann",
        "stream_url": "https://www.luxubu.review/v/7yvw00j74xo",
        "description": "After Mr. Baumann, the grouchy storekeeper, realizes from Ben that his temper comes from being lonely he starts soul-searching. Eventually he stumbles across a secret not from this earth."
    },
    {
        "title": "Fight at the Museum",
        "stream_url": "https://www.luxubu.review/v/4dvjzz17qyo",
        "description": "When Ester invites Ben (who brings along Rook to her dismay) to a museum exhibit displaying alien artifacts, they encounter Ben's former crush Kai. When Ester discovers their relationship she immediately becomes jealous of her. The four of them are forced to team up, however, when a priceless exhibit that Kai put on display is stolen. Chrono Spanner also reappears again, this time trying to convince Ben that he's \"destined\" to marry Kai, to Ester's chagrin."
    },
    {
        "title": "Breakpoint",
        "stream_url": "https://www.luxubu.review/v/549yppj07x9",
        "description": "Fistrick orchestrates a series of robberies while wearing ID masks to make him and his compatriots to resemble Ben. When the real Ben discovers what's going on he decides to go undercover with Rook's help and investigate Fistrick's workout gym to find out what's going on. As this is all happening, Ben is struggling with his obsessive cravings for chili fries and meatball subs."
    },
    {
        "title": "The Color of Monkey",
        "stream_url": "https://www.luxubu.review/v/p69g7703rx9",
        "description": "With the help of the con-artist Simian, Argit starts a secure transport firm called \"Argistix Securities\" employing a group of Techadons as workers. Ben immediately becomes suspicious of Argit's business, considering the latter's history."
    },
    {
        "title": "Vreedlemania",
        "stream_url": "https://www.luxubu.review/v/zyonzzqpe8o",
        "description": "Pa Vreedle (Blum) reunites with Ma for all-out, total cosmic destruction! Meanwhile, Rhomboid and Octagon try to impress Ma and Pa Vreedle like Isosceles and Parallelogram Vreedle (Beth Littleford & Robinson) always does."
    },
    {
        "title": "It's a Mad, Mad, Mad Ben World, Part 1",
        "stream_url": "https://www.luxubu.review/v/809e557wd79",
        "description": "A dangerous Chronosapien named Maltruant (Mark Hamill) attempts to obtain total control over the space-time continuum; Ben 23 is sent by the Azmuth of his dimension to Ben Prime's dimension for the latter to act as a \"mentor\" to the former."
    },
    {
        "title": "It's a Mad, Mad, Mad Ben World, Part 2",
        "stream_url": "https://www.luxubu.review/v/8gvz66jr2yo",
        "description": "With the help of Dr. Psychobos, Ben 23 and Ben Prime successfully stage a breakout and revolution in Mad Ben's labor camp."
    },
    {
        "title": "From Hedorium to Eternity",
        "stream_url": "https://www.luxubu.review/v/mz9k33k-81v",
        "description": "In a flashback to Ben and Gwen's younger days when they were eleven, Zs'Skayr returns with a plan to have his fellow Ectonurites to possess the inhabitants of Bellwood to develop a device to block out the sunlight on Earth so he can colonize the planet with more Ectonurites."
    },
    {
        "title": "Stuck on You",
        "stream_url": "https://www.luxubu.review/v/eno8mmx3x0v",
        "description": "Khyber teams up with a Slimebiote, a DNA-eating parasite, named Skurd (Kaye) so he can safely use the Nemetrix to eliminate Ben. The plan backfires when Skurd discovers the amount of DNA he can consume from the Omnitrix and decides to latch onto it. As Khyber goes mad from extended use of the Nemetrix, Skurd gives Ben a combative edge, giving Rook time to remove the Nemetrix with minimal damage to Khyber."
    },
    {
        "title": "Let's Do the Time War Again",
        "stream_url": "https://www.luxubu.review/v/05ol11zxzn9",
        "description": "Exo-Skull, Subdora (Kaye & Platt), and Eon attack a hidden cavern to retrieve a rare egg of a Time Beast. Professor Paradox (David McCallum) and Ben 10,000 teams up with Ben and Rook to stop the Time Beast. Rook, Ben and Skurd go after the Time Beast while Ben 10,000 and Professor Paradox fight Exo-Skull and Subdora. However, a series of mistakes lead the five of them to constantly travel through time to correct their actions. Eventually the time beast is captured, but at the end of the episode, Eon delivers two Time Beast eggs to Maltruant."
    },
    {
        "title": "Secret of Dos Santos",
        "stream_url": "https://www.luxubu.review/v/54oyppj5jxo",
        "description": "During Kai's search for the Temple of the Sky, she reluctantly teams up with Ben, Skurd, and Rook at the insistence of Kai's grandfather. As they search, Ben teases Kai about Spanner telling them they are married in the future, and as he shows her more clues they show more attraction, despite Kai denying Spanner's prediction. Upon reaching the temple and finding the relic inside, the guardian of the temple is an eons old Galvan tasked with protecting a dangerous component of Maltruant."
    },
    {
        "title": "Third Time's a Charm",
        "stream_url": "https://www.luxubu.review/v/8xop66kgyqv",
        "description": "Charmcaster traps Gwen in Ledgerdomain to exact her revenge once and for all, turning her into a stone totem. When she attempts to take over Gwen's headquarters at Friedkin University (Tom Kenny), Ben, Kevin and Rook fight back with the aid of the great sorcerer Bezel. Charmcaster is eventually defeated and turned into a totem herself, trapped in her own bag, which restores Gwen, Hex, Adwaita (Blum), and Darkstar to normal. Darkstar is arrested, Adwaita escapes, and Charmcaster is kept in Hex and Gwen's custody under the hope that she will see the error of her ways someday."
    },
    {
        "title": "The Final Countdown",
        "stream_url": "https://www.luxubu.review/v/8x9p66k58qo",
        "description": "While Rook is stuck on graveyard shift at Plumber HQ, his sensei Kundo returns to purge the galaxy of technological influence. Ben and Max take a massive Plumber squadron to stop Yeta (Morgan Lofting), a female Shocksquach alien, from continuing her criminal destruction. They later find HQ on lockdown because of Kundo and try to break into the base to give Rook back up. Fistina, the only prisoner, is deputized by Rook so as to help defeat Kundo. Following Kundo's defeat, Rook is effectively promoted to Magister and Fistina is allowed to go to the academy following her time served."
    },
    {
        "title": "Malgax Attacks",
        "stream_url": "https://www.luxubu.review/v/54vypp565xv",
        "description": "Ben finally manages to rid himself of Skurd, just when he needs the Slimebiote most. Vilgax and Albedo team up to steal Malware's calcified husk to convert into a war armor for Vilgax to defeat Ben. As Ben fights Vilgax, he realizes how much he needs Skurd to help him, while Azmuth, Luhley, Blukic and Driba fight Albedo. Azmuth uses a device he made years ago which disables Albedo's Ultimatrix and frees Skurd, in time to merge with Ben and defeat Vilgax. Ben thanks Skurd for his rescue, while Luhley decides to go on a date with Driba, while having her cousin date Blukic. In space, Vilgax's stone form oozes out what appears to be a reconstituted Malware."
    },
    {
        "title": "Most Dangerous Game Show",
        "stream_url": "https://www.luxubu.review/v/8xop66xx2qv",
        "description": "Ben is being forced to be in an alien reality show called The Most Delicious Show (Charles Phoenix) and he watches as all the girls he'd met in his life to win the reality show's games to be the new Mrs. Tennyson. Soon, Kai Green wins the reality show, with Ester later revealing that she found another boyfriend–Sunny's old sweetheart Antonio."
    },
    {
        "title": "The End of an Era",
        "stream_url": "https://www.luxubu.review/v/059l11ll1nv",
        "description": "In the future, Ben 10,000 and Kai Tennyson are having a party for Grandpa Max because he is retiring from the Plumbers and Rook is being promoted to be in charge of the Plumbers until Maltruant, Exo-Skull and Subdora secretly attack Plumbers' Headquarters to get the Annihilaarg and Dwarf Star. Ben 10,000 and Kai both discover that their ally Chrono Spanner is actually their own son, Ken Tennyson."
    },
    {
        "title": "A New Dawn",
        "stream_url": "https://www.luxubu.review/v/4l9000kk0x9",
        "description": "Following Maltruant through the time stream, Ben has an adventure with George Washington, in 1773, fighting Maltruant and Vilgax. After defeating Vilgax, Ben and Rook chase Maltruant in the time stream to the beginning of time itself onto the starship of the Contemelia (the creators of the Annihilaarg) where Maltruant attempts to create a universe of his own using his own Anihilaarg. In a climactic battle, using the power of Feedback, Ben absorbs the Dwarf Star-powered Anihilaarg and uses its power to defeat Maltruant, trapping him in a time loop that will result in him reliving the events of the Time War for eternity. Back on Earth, Ben decides to go on a road trip across the recreated universe with Rook, Gwen and Kevin, concluding the series."
    }
]