[
    {
        "title": "Fame",
        "stream_url": "https://www.luxubu.review/v/2wvm7k25elv",
        "description": "Ben Tennyson's secret identity is exposed to the world by an online video, ending his secretive life of heroism. Public opinion on Ben is polarized; he is idolized as a superhero by kids and teens, but distrusted by adults, particularly news anchor Will Harangue, who deems Ben a menace. Ben, Gwen, and Kevin decide to pay a visit to the Internet conspiracy theorist who exposed Ben's identity, revealed to be a ten-year-old boy named Jimmy Jones who runs a website on alien sightings. Not recognizing one of the aliens on Jimmy's website, Ben and his team travel to Orlando, Florida, the site where the photograph was taken, to investigate. Ben's team is brought into custody by the U.S. military, where Air Force Colonel Rozum explains that the alien in question has been stealing parts from a NASA interstellar rocket called Orion. Ben confronts the alien, named Bivalvan, who explains that he is trying to leave Earth after having been stranded there. Ben defeats Bivalvan, who reveals that he is from the Andromeda Galaxy and was kidnapped along with four other aliens by a monster named Aggregor. Ben and his team leave to retrieve the Plumbers, but Bivalvan is recaptured by Aggregor. Later, Ben's classmates take his side and clap for him and the lives he's saved."
    },
    {
        "title": "Duped",
        "stream_url": "https://www.luxubu.review/v/7y9w0md4-xv",
        "description": "Ben's girlfriend Julie Yamamoto has a major tennis match, but Ben is torn between attending and aiding Kevin in stopping the Forever Knights from robbing a museum, while also wanting to watch a new Sumo Slammers movie. Ben eventually turns into Echo Echo and divides into three copies, then returns to his human form so that he can attend all three events at once. However, the split causes Ben's personality to be divided among the trio; while the arrogant Ben attends Julie's match, the kind Ben aids Kevin and the rational Ben watches the movie. Eventually, all three Bens reunite to help defeat the Forever Knights to prevent them from stealing ancient alien battle armor. Ben attempts to reconcile with Julie, but after revealing his actions, she is disgusted with him and storms off."
    },
    {
        "title": "Hit 'Em Where They Live",
        "stream_url": "https://www.luxubu.review/v/4l900l1gkx9",
        "description": "Ben learns from Grandpa Max that the exposure of Ben's identity has caused various old enemies of his to crawl out of the woodwork, seeking revenge by targeting Ben's loved ones. Ben, Gwen, and Kevin trail Ben's father Carl, intercepting a team of villains consisting of Charmcaster, Vulkanus, and Zombozo the clown. The team succeeds in protecting Carl and split up to protect Ben's family, but Gwen is ambushed by Charmcaster, resulting in Ben's mother Sandra being captured. The team tracks Zombozo to a nearby circus, where Kevin defeats Charmcaster and Ben defeats Vulkanus. Gwen is captured by Zombozo, but takes on her full Anodite form and frightens Zombozo into fleeing, rescuing Sandra in the process."
    },
    {
        "title": "Video Games",
        "stream_url": "https://www.luxubu.review/v/pm95pmyg58o",
        "description": "Ben is approached by video game producer Oliver Thompson, who invites Ben to be the star of his own video game, scanning Ben's alien forms into a computer for motion capture. In reality, however, Oliver is in the employ of Will Harangue, who is developing a battle robot called the Stalker to target and destroy Ben by analyzing and predicting his moves. The Stalker attacks and nearly kills Ben, but Harangue holds back, wishing to exploit Ben's battles with the Stalker for television ratings. He publicly challenges Ben to a final battle at the National Mall in Washington, D.C. Ben is able to defeat the Stalker by using Nanomech, who was too small for the computer to scan; subsequently, Ben uses Way Big to crush the Stalker as well as Harangue's car."
    },
    {
        "title": "Escape From Aggregor",
        "stream_url": "https://www.luxubu.review/v/p6og7wer6xo",
        "description": "Ben, Gwen, and Kevin defeat an alien rampaging through the streets of Bellwood. Through a universal translator, they learn that the alien, Galapagus, was only trying to get Ben's attention in order to seek his help. Galapagus explains that he was one of the five aliens from the Andromeda Galaxy captured by Aggregor, who brought him into a cell on his spaceship along with the other prisoners: Bivalvan, Ra'ad, P'andor, and Andreas. The aliens manage to escape, but are divided on what action to take: Bivalvan, Ra'ad, and Galapagus send a distress signal out to nearby Plumbers, while P'andor and Andreas confront Aggregor. Aggregor defeats and recaptures them, subsequently killing Magister Prior Gilhil, the Plumber responding to their distress call. Galapagus seemingly betrays the other aliens to Aggregor, but instead turns on Aggregor and helps them flee to a nearby spaceship, which they take to Earth and then go their separate ways. Ben sends Galapagus home via a Plumber ship, but the pilot is revealed to be Aggregor in disguise, who recaptures Galapagus."
    },
    {
        "title": "Too Hot To Handle",
        "stream_url": "https://www.luxubu.review/v/eno8mjwg50v",
        "description": "Kevin takes on an underground job to open a safe for a large sum of money, only to discover that the employer is P'andor, one of the missing Andromeda aliens, who wishes to be freed from a containment suit that he has been kept in. Kevin refuses to free P'andor after his Plumber's badge detects radiation in the suit; the two battle, but Kevin flees, and P'andor steals a shard of taydenite - the strongest mineral in the galaxy - from him. After Kevin informs Ben and Gwen about P'andor, Gwen insists that they help free him, but Kevin refuses on the basis of him being too dangerous. The trio find and confront P'andor, who attempts to use the taydenite to free himself, but is unsuccessful; he realizes that he needs Kevin to absorb the taydenite in order to free him. P'andor has his minions kidnap Kevin, who taunt him into liberating P'andor, revealing himself as an energy-based alien who absorbs radiation. Ben disguises as Bivalvan and tries to dissuade P'andor from attacking a nuclear power plant, but this only results in a fight. Ben and Kevin ultimately work together to defeat P'andor, who is arrested by the Plumbers. Aggregor then attacks the Plumbers' ship and captures P'andor."
    },
    {
        "title": "Andreas' Fault",
        "stream_url": "https://www.luxubu.review/v/3q917png829",
        "description": "Argit is running a con selling insurance to the Forever Knights, threatening that if they do not pay him, he will destroy their castles. Ben, Gwen, and Kevin investigate and discover that Argit has befriended Andreas, one of the missing Andromeda aliens, and manipulated him into destroying the castles; out of fear, the Forever Knights have now become Argit's servants. Argit is confronted by Sir Dagonet, a legendary Forever Knight seeking to liberate the knights from Argit's influence; he captures Argit, Andreas, Ben, Gwen, and Kevin, intending to execute Andreas using an energy cannon. Ben and the team free Andreas, but Dagonet turns the cannon into a bomb and flees with the knights. On Argit's insistence, Andreas absorbs the bomb's blast, saving the others but seemingly dying in the process. Kevin punches Argit in outrage, and they part ways. Later, Andreas is shown to have survived, and is recaptured by Aggregor."
    },
    {
        "title": "Fused",
        "stream_url": "https://www.luxubu.review/v/8xop65rq-qv",
        "description": "Ben is attacked in the dead of night by Ra'ad, the last of the Andromeda aliens, but Ben defeats him. Captured in the abandoned military base at Los Soledad, Ra'ad reveals that Aggregor recaptured the other four aliens and blames Ben for it. Ra'ad asserts that the Ultimatrix led Aggregor to the other aliens, and attacks it in an attempt to deactivate it, causing an explosion and vanishing. Ben and his team are subsequently attacked by Aggregor, whom Kevin realizes is an Osmosian - the same species as Kevin's father, and thus possessing the same power to absorb energy that Kevin has. Ben transforms into an Amperi, the species of Ra'ad, and is trapped in his alien form; he realizes that he and Ra'ad are sharing their consciousness. Fleeing from Aggregor to Kevin's garage, Kevin is able to split Ben and Ra'ad, but Ra'ad flees as Aggregor arrives. Aggregor defeats Kevin and Gwen and nearly kills Ben, but Ra'ad intervenes out of guilt and electrocutes Aggregor. Kevin's garage explodes, and Ra'ad is recaptured, but Ben vows to use the powers of the Andromeda aliens to rescue them."
    },
    {
        "title": "Hero Time",
        "stream_url": "https://www.luxubu.review/v/dw9r50d1-po",
        "description": "Vampire Summer movie star Jennifer Nocturne is attacked by mercenaries, but rescued in a joint effort by Ben and Carl Nesmith, a.k.a. Captain Nemesis, a real-life superhero and billionaire whom Ben idolizes. Jennifer is infatuated with Ben and kisses him, to Nesmith's jealousy. Subsequently, Ben and Jennifer become friends, much to the jealousy of Julie. It is then revealed that Nesmith secretly orchestrated the attack on Jennifer to gain popularity, and is conspiring with Will Harangue to boost his public image. After Ben and Nesmith work together to battle against extradimensional robots, Harangue slanders Ben and prompts Nesmith to challenge Ben to a friendly competition. Ben wins the competition, which outrages Nesmith, who resorts to kidnapping Jennifer and Julie. Ben rescues the two and defeats Nesmith, chastising him for losing sight of what it means to be a hero. Nesmith is then arrested."
    },
    {
        "title": "Ultimate Aggregor",
        "stream_url": "https://www.luxubu.review/v/5jo4xkrg5xv",
        "description": "A group of Plumbers ambush Aggregor in an attempt to rescue the Andromeda aliens, but are overwhelmingly defeated. The team then learns from Colonel Rozum that Aggregor has taken the aliens to Los Soledad; Professor Paradox then appears and reveals that Aggregor is using Paradox's technology to facilitate the total absorption of the aliens. Ben and his team confront Aggregor, with Kevin attempting to reason with him, insisting that energy absorption causes Osmosians to lose their sanity. Aggregor asserts that these are merely lies, and absorbs the aliens into himself; the aliens disappear, and Aggregor emerges as a monstrous amalgamation of their forms."
    },
    {
        "title": "Map of Infinity",
        "stream_url": "https://www.luxubu.review/v/05ol1k4q2n9",
        "description": "Believing that Aggregor has killed the Andromeda aliens, Ben attacks him viciously, only to learn that Aggregor's new form makes him virtually invulnerable. After Aggregor leaves Earth, Ben and his team are brought to Galvan Prime by Azmuth, who explains that Aggregor's goal is to acquire the Map of Infinity - a complete map of spacetime which will lead him to a mysterious realm known as the Forge of Creation, where he can acquire unlimited power. Because of the map's importance, Professor Paradox separated it into four pieces and hid them throughout the universe in secure locations; Aggregor absorbed the powers of the Andromeda aliens to make him powerful enough to retrieve them. Ben, Gwen, and Kevin travel to the tidally locked planet Mykdl'dy to retrieve the first piece of the Map of Infinity, encountering a group of Necrofriggians and entering an ancient temple. Inside of the temple, the trio evade a series of traps, but end up at the mercy of Aggregor, who takes the piece of the Map of Infinity and leaves. Ben and the others barely escape, resolving to prevent Aggregor from getting any of the other pieces."
    },
    {
        "title": "Reflected Glory",
        "stream_url": "https://www.luxubu.review/v/dw9r50d1rpo",
        "description": "While fighting the Forever Knights, Ben learns that his former bullies Cash and J.T. have started a web show with the aid of Oliver Thompson, claiming themselves to be the masterminds behind Ben's success. Ben reluctantly agrees to participate in the web show after Cash reveals that he needs the money for his mother's operation. The group learns that the Forever Knights are developing a power decoupler, a deadly cannon which absorbs energy from its surroundings. Ben and his team defeat the Forever Knights but are suddenly attacked by Psyphon, Vilgax's former subordinate, who saw the web show and wishes to kill Cash and J.T. to avenge Vilgax's death. At Psyphon's mercy, Cash reveals that the web show was a lie and that his mom only needed money for a nose job. Psyphon attacks Ben instead, but Cash and J.T. fire the power decoupler at Psyphon, defeating him. However, because the decoupler disabled Oliver's camera, there is no evidence that Cash and J.T. were able to defeat Psyphon, leaving them ridiculed."
    },
    {
        "title": "Deep",
        "stream_url": "https://www.luxubu.review/v/pm95pmyg18o",
        "description": "Ben, Gwen, and Kevin are summoned to the aquatic planet Piscciss (Ripjaws's homeworld) by Magister Pyke, a Plumber who reports that Aggregor has been sighted near the planet's solid core. Ben and the team pursue Aggregor and reach the planet's center, learning that the second piece of the Map of Infinity is disguised as a gravitational device which is responsible for holding Piscciss's liquid atmosphere together. Aggregor steals the piece of the map and flees, causing the planet to come apart; Ben transforms into Goop and uses his antigravity device to replace the map piece, which stabilizes the planet's atmosphere. While Ben and his team are celebrated by the people of Piscciss for saving their world, they lament that Aggregor has once again escaped from them."
    },
    {
        "title": "Where The Magic Happens",
        "stream_url": "https://www.luxubu.review/v/3q917pngd29",
        "description": "Ben, Gwen, and Kevin pursue Aggregor to a mystic doorway known as the Door to Anywhere, through which Aggregor escapes to an unknown realm. Believing she knows somebody who can help them follow Aggregor, Gwen finds Charmcaster, whom she convinces to aid them after revealing that the dimension Aggregor went to was virtually made of mana. Charmcaster explains that this dimension is Ledgerdomain, the \"realm of magic\" where Charmcaster herself was born. The group is able to activate the door and enter Ledgerdomain, where they are confronted by Addwaitya, a dark magician who rules Ledgerdomain through an artifact called the Alpha Rune. Charmcaster reveals that her father, Spellbinder, was killed in the process of helping Hex and Charmcaster escape from Addwaitya and Ledgerdomain. The team is able to navigate Ledgerdomain and reach Addwaitya, who is suddenly defeated by Aggregor, who steals the Alpha Rune - revealed to be a disguised piece of the Map of Infinity. Aggregor escapes and the team flees Ledgerdomain, but Charmcaster stays behind, intending to avenge her father. Charmcaster is stranded in Ledgerdomain, and Ben states that they only have one more chance to defeat Aggregor."
    },
    {
        "title": "Perplexahedron",
        "stream_url": "https://www.luxubu.review/v/4lo00l1g7xo",
        "description": "Following the events of the previous episode, Azmuth contacts Ben's team and teleports them to the location of the final piece of the Map of Infinity: a huge, cube-shaped structure known as the Perplexahedron, located in another galaxy. The team pursues Aggregor to the interior of the Perplexahedron, discovering that it is an enormous, shifting maze designed by Professor Paradox to protect the final piece of the map from all who are unworthy. Ben eventually deduces a way to navigate the maze, and the trio are able to outmaneuver Aggregor and beat him to the center of the Perplexahedron. There, they meet the Sentinel, an alien who exists to protect the map piece. Ben retrieves the piece, causing the Perplexahedron to begin collapsing; while they try to flee, Ben decides to go back to save the Sentinel. In the process, Ben and Aggregor battle, and Aggregor steals the last piece. The Sentinel, lamenting that all is lost, vanishes in Ben's arms; Ben, resolving to honor him, declares that they will stop Aggregor."
    },
    {
        "title": "The Forge of Creation",
        "stream_url": "https://www.luxubu.review/v/8xop65rqdqv",
        "description": "On Galvan Prime, Azmuth chastises Ben, Gwen, and Kevin for their failure to stop Aggregor from acquiring the completed Map of Infinity. Ben decides to turn into Alien X, his most powerful alien form possessing virtual omnipotence, in the hopes of stopping Aggregor; however, Ben is unable to convince Alien X's split personalities to cooperate, and Professor Paradox ultimately reverts Ben to human form. Paradox explains that the Forge of Creation is the birthplace of Celestialsapiens, the species of Alien X; Aggregor intends to absorb the powers from an infant member of their species, which will give him infinite power. Paradox teleports the team to the Forge of Creation, which is out of sync with time itself due to a chrono-randomization barrier. When Ben falls through the barrier, he accidentally summons a ten-year-old version of himself, who agrees to help them stop Aggregor. In the center of the Forge of Creation, the team battles Aggregor on the palm of a mother Celestialsapien, but all of them are defeated. As a last resort, the ten-year-old Ben convinces Kevin to absorb the Ultimatrix's power, turning him into a monstrous amalgamation of Ben's aliens. Kevin easily defeats Aggregor, but loses his mind and flees. Paradox returns the young Ben to his timeline, while the old Ben resolves to find and rescue Kevin."
    },
    {
        "title": "...Nor Iron Bars a Cage",
        "stream_url": "https://www.luxubu.review/v/8goz63-2ly9",
        "description": "The mutated Kevin voluntarily imprisons himself in Incarcecon, a prison in the Null Void dimension, in the hopes of murdering the prison warden Morgg. In a flashback, it is revealed that Kevin was imprisoned at Incarcecon shortly after being sent to the Null Void in the original Ben 10 series, where he befriended a kindhearted prisoner named Kwarrel. Kwarrel helped Kevin escape from Incarcecon, but was killed by Morgg. In the present day, Morgg has converted the prisoner into a secret drug trafficking operation, forcing the prisoners to mine a hallucinogenic dust from beneath the prison. Ben and Gwen arrive at the prison to warn Morgg of the threat on his life, discovering the drug operation in the process. Kevin tries to kill Morgg but is thwarted by Ben, then flees. Morgg is arrested by the Plumbers, and Ben, believing Kevin is too far gone, tells Gwen he believes they need to \"put him down.\""
    },
    {
        "title": "The Enemy of My Enemy",
        "stream_url": "https://www.luxubu.review/v/3qo17png22o",
        "description": "While Ben and Gwen argue over how to deal with an increasingly deranged Kevin, they suddenly run into Argit, who claims that Kevin is trying to kill him. Argit asks them to place him into the custody of the Plumbers at the Plumbers' Academy. At the academy, Argit encounters the Vreedle Brothers, who are training to be Plumbers, and reveals that he was sent by their father, Pa Vreedle, to manipulate their test scores so that they pass. Meanwhile, Kevin pursues Argit to the academy and attacks the students and Argit, prompting the Vreedles to set off a bomb that will destroy the entire academy. Ben throws the bomb out into space, while Kevin assaults and seemingly kills Argit, horrifying Gwen. Kevin leaves, and Ben reveals that Argit was merely playing dead. As Gwen stares out into space, Ben approaches her, and they once again debate over whether Kevin can be saved."
    },
    {
        "title": "Absolute Power, Part 1, Part 2",
        "stream_url": "https://www.luxubu.review/v/7q97nqy17wv",
        "description": "At the beginning of the episode, Kevin attacks and steals the powers of the half-human Alan Albright, but is driven off by Ben before he can kill him. Alan reveals that Kevin has already stolen the powers of all of the Plumbers' Helpers as well as Ben's old foe Dr. Viktor. Ben, convinced that he must eliminate Kevin for the safety of the Earth, asks Gwen to help track Kevin with her powers. Gwen refuses, and the two argue, which leads to them battling each other; Ben defeats Gwen with Way Big, claiming her sentimentality prevents her from having what it takes to deal with Kevin. Ben then indiscriminately seeks out other villains, attacking them mercilessly in search of Kevin's whereabouts. Gwen, meanwhile, locates their old enemy Michael Morningstar and asks for his help. Ben and Gwen separately consult Grandpa Max about how to deal with Kevin; while Max encourages Gwen to stay out of Ben's way, he admits to Ben that his decision to kill Kevin is unlike him.\n\nGwen is able to escape from Kevin and flees with Ben and Michael; Michael reveals that this was all according to his plan, and now that Kevin has had a taste of Gwen's power, he will continue to seek her out. Kevin arrives at Gwen's house, but is confronted by Grandpa Max, whom he easily defeats. Kevin then encounters his stepfather Harvey Hackett, who attempts to dissuade Kevin from hurting Gwen, mentioning that Kevin's mother would be heartbroken to see what he has become. Ben intervenes, however, and reveals that it was all a ploy by Gwen to make Kevin see the error in his actions. Kevin attacks Gwen and Ben intervenes, but is defeated; Julie appears with Ship and blasts Kevin, buying Gwen enough time to flee to Los Soledad, where Michael and Cooper Daniels are preparing the Dominus Librium. Kevin arrives, but Ben attacks him viciously as Ultimate Echo Echo, knocking him unconscious and preparing to kill him. However, Gwen convinces Ben to give them a chance to save Kevin. The Dominus Librium absorbs Kevin's powers, restoring him to his normal form. Michael betrays the group and absorbs Kevin's powers, but Ben uses a device to remove the power and send it back where it came from, restoring the Andromeda aliens to life. Kevin knocks out Michael, and he, Ben, and Gwen reconcile."
    },
    {
        "title": "The Transmogrification of Eunice",
        "stream_url": "https://www.luxubu.review/v/dw9r50drlpo",
        "description": "While on a camping trip in the wilderness, Ben, Gwen, and Kevin witness a spacecraft falling from the sky and crashing into a field, revealing a mysterious pod. Gwen touches the pod and causes it to open, revealing a beautiful, unclothed human girl. The girl, who calls herself Eunice, claims she has no memory of where she came from. Ben and Eunice become infatuated with each other, and when confronted by Gwen, Ben asserts that Julie broke up with him. Ben and Eunice grow closer, but they are suddenly attacked by the bounty hunter Sunder, who reveals that Eunice is in fact an Omnitrix-like device assuming a humanoid form. Sunder is then revealed to have been employed by Azmuth to retrieve Eunice, a.k.a. the Unitrix, a prototype Omnitrix. Eunice absorbed and randomized Gwen's DNA to take on her current human form. Azmuth claims that Eunice is no more real than Ben's transformations, but Ben threatens to fight Azmuth, prompting Azmuth to reluctantly recruit Eunice to aid him in work on Primus."
    },
    {
        "title": "Eye of the Beholder",
        "stream_url": "https://www.luxubu.review/v/8xop65rdeqv",
        "description": "On a distant planet, the Galvanic Mechamorph known as Baz-l is captured by a race of aliens. On Earth, Ship, sensing that Baz-l is in danger, suddenly flies off, prompting Julie to reluctantly ask for Ben's help. The two argue, with Julie claiming that she never broke up with Ben, until ultimately Kevin and Gwen agree to help Julie out of annoyance with Ben. Ben follows them to the planet, where they reunite with Ship. Baz-l is revealed to have stolen a valuable artifact from a race of religious aliens. Ben and the team defeat the aliens, and Ben promises to be a better boyfriend for Julie."
    },
    {
        "title": "Viktor: The Spoils",
        "stream_url": "https://www.luxubu.review/v/8godedq4rp9",
        "description": "In the Eastern European monarchy of Zarkovia, Prince Gyula reveals to his father, King Xarion, that he has acquired the corpse of Dr. Viktor, and intends to weaponize it to crush internal rebellion in the country alongside Gyula's mind-controlled army. Xarion, fearing the prince, summons Ben, Gwen, and Kevin to remove Dr. Viktor from Gyula's custody. Gyula confronts them and unleashes Viktor, who is under his mind control, who quickly defeats and captures the trio along with King Xarion. Gwen helps Xarion escape, but Xarion betrays her and drags an unconscious Ben into his lab. Using AmpFibian, Xarion transfers his mind into Viktor's body, becoming \"King Viktor,\" a virtually unstoppable weapon. King Viktor attacks his son and unleashes his wrath on the rebels, but is attacked and defeated by Ben, Gwen, and Kevin. However, they are unable to take King Viktor to the Null Void due to the Plumbers not having the authority to arrest Xarion. Gyula declares that he will hang King Viktor, but Ben frees Gyula's army from his mind control so that they can choose their own sides, then leaves the country with Gwen and Kevin."
    },
    {
        "title": "The Big Story",
        "stream_url": "https://www.luxubu.review/v/7qv7nqy40wo",
        "description": "Jimmy Jones sees a meteor crashing into a cave and investigates, where he is attacked by a plant-like alien monster. Jimmy tells Ben and his team about the alien, but only Ben believes him, and agrees to investigate. Ben enters the cave, but comes out saying that he found nothing inside. Uncertain, Jimmy later returns to the cave, where he sees Ben seemingly talking to the plant monster and declaring that he serves its will. Jimmy tries to tell Gwen and Kevin, who disbelieve him; he then goes on Will Harangue's show, but Harangue merely twists Jimmy's story to say that Ben intends to invade the Earth. Jimmy is then confronted by Ben, who attacks him. Jimmy flees and encounters Gwen and Kevin, only to learn that they too went to the cave and are behaving strangely. The trio capture Jimmy and take him to the cave, where he sees the real Ben, Gwen, and Kevin captured in pods; the others are genetic copies created by the plant monster, which intends to take over the world and turn it into a \"garden.\" Jimmy learns that the monster is allergic to peanuts, and uses his bags of peanuts to free Ben and the others and destroy the monster. Ben, Gwen, and Kevin then assure Jimmy that they will take him seriously from now on."
    },
    {
        "title": "Girl Trouble",
        "stream_url": "https://www.luxubu.review/v/1lo61lm3dl9",
        "description": "After a battle against the robots from Dimension 12, Ben, Gwen, and Kevin return to Gwen's house only to encounter Sunny, Gwen's frivolous and obnoxious cousin whom she used to play with as a child. Gwen's mother Natalie says that Sunny is staying with them for the summer and orders Gwen to supervise her. The team confronts the Dimension 12 robots, and Sunny suddenly joins the battle using mana, revealing that she is an Anodite. At Gwen's house, they are suddenly visited by Antonio, a huge alien and Sunny's boyfriend. Natalie forbids Sunny from seeing Antonio, but she and Antonio escape, pursued by Gwen. Ben tells Gwen that the robots are back, and they arrive at a particle accelerator where the robots have built a bomb. They defeat the robots alongside Antonio and Sunny, but Sunny refuses to follow Gwen's orders to return home, and sheds her human skin, declaring that nobody make her do anything. They battle, and Ben defeats Antonio, while Gwen summons Grandma Verdona to take Sunny and Antonio back home."
    },
    {
        "title": "Revenge of the Swarm",
        "stream_url": "https://www.luxubu.review/v/4dojzewp0y9",
        "description": "Ben is visited in the middle of the night by Victor Validus, who uses alien microchips to attack him. Ben is able to drive him off, and acquires one of the microchips in the process. He consults Gwen and Kevin, who insist that Validus was cured a long time ago after Ben destroyed the queen of the microchip hive during the events of Ben 10: Alien Swarm. They agree to investigate Validus's old lab, where they find a janitor who claims that Validus is dead. The group visits Elena at her lab, where she reveals she is studying the nanochips in order to apply them to better the world. Elena claims that she doesn't know where the nanochip they encountered came from. Later, Kevin and Gwen are attacked by Victor Validus, who flees after Ben appears. Ben then meets with Julie, and agrees to have lunch with her at Burger Shack; however, Julie is attacked and captured by Victor Validus. Realizing the truth, Ben confronts Elena, who is revealed to be the true queen of the nanochips; she created the fake Victor Validus clones and kidnapped Julie out of jealousy, and wishes to have Ben to herself. Elena begins to suffocate Ben, and loses control of her powers; realizing she must destroy herself in order to save him, Elena disintegrates her body with a nearby force field. Julie claims that Elena was already gone, but Ben nonetheless laments the loss of his friend."
    },
    {
        "title": "The Creature from Beyond",
        "stream_url": "https://www.luxubu.review/v/yx93kmq24qo",
        "description": "The Forever Knights discover an ancient seal with their insignia and break it open, accidentally unleashing a mysterious creature which kidnaps some of them and flees. Tracking a disturbance in the mana field, Gwen, Ben, and Kevin reach the site of the seal and agree to aid the Forever Knights in finding the creature. They find the creature in the city, where it uses its tentacles to momentarily seize control of Gwen's mind, then escapes. Gwen, who has connected to the creature, reveals that it calls itself \"Lucubra\" and it originated from another dimension. Winston, a Forever Knight squire, reveals that the First Knight - the founder of the Forever Knights - captured the Lucubra in the seal centuries ago. Ben's team follows the Lucubra to a warehouse, but Gwen falls under its influence again, prompting Ben and Kevin to tell her to sit out the fight. They attack the Lucubra along with the Forever Knights, and Gwen is ultimately able to send it back to its dimension. The Knights and the team part ways, but as they leave, Winston is revealed to still be under the Lucubra's influence. Meanwhile, at a retirement home, a mysterious old man senses that the seal has been broken."
    },
    {
        "title": "Basic Training",
        "stream_url": "https://www.luxubu.review/v/5jo4xkrp6xv",
        "description": "Ben, Gwen, and Kevin are summoned to the Plumbers' Academy to complete their basic training for Plumber duty, as they originally received their deputy Plumber titles on the field. At the academy, they befriend an alien named Tack, while Ben comes at odds with their instructor, a strict yet decorated Plumber named Magister Hulka. As they train, several incidents occur which lead Ben and the team to suspect that someone is targeting Hulka with the intent to assassinate him. Investigating, they eventually discover that the attacker is Kolar, a Tetramand and one of Hulka's old foes. Together, they defeat Kolar and send him to the Null Void. Ben, Gwen, Kevin, and Tack then graduate from the Plumbers' Academy and are made formal Plumbers, while Hulka gives Ben an award for his creative tactics."
    },
    {
        "title": "It's Not Easy Being Gwen",
        "stream_url": "https://www.luxubu.review/v/54vyp4md8xv",
        "description": "The episode focuses on the daily life of Gwen as she juggles her various responsibilities, including school, her mother's errands, her friend Emily's piano concert, and the threat of Dr. Animo. As Gwen struggles to concurrently carry out her various tasks, she ultimately helps Ben and Kevin defeat Dr. Animo, and makes it to Emily's concert just in time to see her finish."
    },
    {
        "title": "Ben 10,000 Returns",
        "stream_url": "https://www.luxubu.review/v/6mv2pm10yd9",
        "description": "Twenty years in the future, a version of Ben 10,000 defeats Eon and seemingly destroys him using Clockwork's powers. However, Professor Paradox appears and reveals that Eon was merely sent back in time twenty years. In the present day, Ben, Gwen, and Kevin arrive at a museum to investigate a signal that the Ultimatrix received. They find a mysterious artifact and are attacked by ninja-like assailants who emerge from it; they defeat the ninjas, but before they can unmask them, the ninjas vanish. Gwen performs a spell on the artifact and sees into another reality (the world of Ben 10: Race Against Time), where Ben, Gwen, and Grandpa Max are confronting Eon. Paradox and Ben 10,000 then appear, explaining that the artifact is the Hand of Armageddon, a gateway that leads to different parallel universes. After being defeated by the Ben from Race Against Time, Eon began travelling between worlds, killing every version of Ben Tennyson he could find. The group resolves to destroy the Hand of Armageddon before Eon can enter their world; however, as the two Bens begin to destroy the device, Paradox realizes that Eon is instead using their powers to open a crosstime breach. Eon emerges and is revealed to be another alternate Ben Tennyson, who has been absorbing other Bens and making them his slaves. He intends to gain enough power to replace the timeline with one where only he exists. However, Ben is able to destroy the Hand of Armageddon, seemingly destroying Eon. Ben 10,000 then returns to his time, while Paradox ominously warns Ben about \"Old George,\" and the \"creature from beyond.\""
    },
    {
        "title": "Moonstruck",
        "stream_url": "https://www.luxubu.review/v/05vl1k42pno",
        "description": "Grandpa Max tells Ben, Gwen, and Kevin the story of how he first met Verdona and became a Plumber. In 1962, a seventeen-year-old Max is a pilot in the Air Force. After spotting a UFO, Max gives chase and shoots it down, only to crash his Lockheed F-104 Starfighter. Max's colonel threatens to discharge him from the Air Force, but Max is summoned by the general, who believes Max's story. He reveals that President John F. Kennedy intends to send humans to the moon in order to meet alien visitors on a level playing field, and invites Max to join the Apollo program as an astronaut. Max agrees, and later visits a bar to celebrate, encountering a beautiful girl named Verdona. Verdona is then attacked by a mysterious robot; Max helps her flee, and Verdona reveals that she is an alien, and that the robot is a Synthroid who kidnapped her in order to use her power to fuel his species' home planet. However, Verdona escaped when Max shot down the UFO. Max and Verdona try to escape, but the Synthroid captures her and takes her to his ship. Through their telepathic connection, Max follows Verdona to the ship, where he and Plumber Magister Labrid destroy the ship and the Synthroid and help Verdona escape. Verdona leaves Earth, but promises to one day return to Max."
    },
    {
        "title": "Prisoner Number 775 Is Missing",
        "stream_url": "https://www.luxubu.review/v/mzvk32n1r1o",
        "description": "The mysterious old man from \"The Creature From Beyond\" approaches Area 51 and breaks in, causing the entire facility to disappear. Ben and the team are summoned by Cooper Daniels to investigate, where they meet Colonel Rozum and discover a layer of metal at the bottom of the crater that doesn't originate from Earth. Rozum reluctantly reveals that beneath the metal is a holding facility containing hundreds of aliens, who have been illegally detained by the Air Force over the course of fifty years after being deemed a threat to national security. The group discovers that one of the prisoners, #775, has escaped and fled in a stolen Plumber ship. Ben, Gwen, and Kevin confront Prisoner 775, who reveals that he was captured unjustly by the Air Force, and while imprisoned, his family members were killed on his home planet. Believing he has nothing left to live for, Prisoner 775 resolves to kill Colonel Rozum in revenge, and travels to Patrick Air Force Base in Florida, where Rozum lives. Ben and the team intervene, and Ben uses Ultimate Wildmutt to defeat 775. 775 is arrested by the Plumbers, while Max chastises Rozum for unjustly capturing the aliens; Rozum justifies it as protecting the safety of the United States."
    },
    {
        "title": "The Purge",
        "stream_url": "https://www.luxubu.review/v/3qo17pnd82o",
        "description": "At a meeting of Forever Knight leaders of different factions, the old man from \"The Creature From Beyond\" reveals himself as George, the First Knight, and the founder of their order. The Forever Knight factions swear allegiance to George, with Driscoll serving as his right-hand man. George orders a purge of all aliens on Earth, and the Forever Knights kill or drive off more than five hundred aliens, including Pierce Wheels. Investigating the Purge, Ben and the team meet Mr. Baumann at his alien food shop, determining that the Forever Knights have targeted it. The Knights attack a group of aliens during a food supply run, and Ben and the team intervene, but the Forever Knights defeat and capture them. Driscoll then threatens to kill the aliens, but Ben challenges him to a duel. Ben defeats him, but Driscoll threatens to kill the aliens if Ben and his allies don't back off; instead, Ben threatens to hunt down and annihilate the Forever Knights if they harm any of the aliens. Driscoll reluctantly withdraws, but George forgives him, saying honor means nothing against alien abominations, and asks Driscoll to prepare for \"the Battle of a Hundred Lifetimes.\""
    },
    {
        "title": "Simian Says",
        "stream_url": "https://www.luxubu.review/v/8gvdedq4gpo",
        "description": "Eunice travels to the planet Aranhaschimmia to investigate a disturbance in the Codon Stream, discovering that the planet has become infested with DNAliens. On Earth, Ben, Gwen, and Kevin are greeted by Simian, who informs them that he accidentally unleashed the DNAliens on Aranhaschimmia while attempting to sell them to a crime lord named Mizaru. The team reluctantly agrees to travel to Aranhaschimmia to stop the infestation, where they encounter Eunice. They discover that Mizaru has gained control over all of the DNAliens and now rules the planet's population completely. However, Ben is able to defeat Mizaru using Ultimate Spidermonkey, and Eunice uses Simian's DNA to free all of the Arachnachimps from the Xenocytes. Mizaru is killed by a root shark, and Ben believes that Simian has reformed; however, it is later revealed that Simian stole their DNA repair guns from the Highbreed War and sold them to the Incurseans."
    },
    {
        "title": "Greetings from Techadon",
        "stream_url": "https://www.luxubu.review/v/5jv4xkrp5x9",
        "description": "Ben is attacked by a succession of powerful Techadon robots which seem bent on his demise. Kevin eventually discovers that the Techadons are a custom job ordered from the elusive weapon masters of Techadon; they will continue to replicate and grow stronger until Ben is killed. Gwen, deducing that Vulkanus was the individual responsible for the custom job, confronts him, and Argit appears and manipulates Vulkanus into traveling to Earth to make sure the Techadons complete their job. Ben and Kevin arrive at the factory producing the Techadons, which has landed in the middle of the city, but are unable to enter it. The Techadons continue to attack Ben, but Ben deduces that they are targeting the Ultimatrix, and fools them by hiding it with his jacket. Kevin then uses an ID mask to place an Ultimatrix badge on Vulkanus's back, thus making him the new target of the Techadons."
    },
    {
        "title": "The Flame Keepers' Circle",
        "stream_url": "https://www.luxubu.review/v/4lv00l17nxv",
        "description": "Julie invites Ben and Kevin to visit the headquarters of the Flame Keeper's Circle, a cult she has recently joined. Their leader, Conduit Edwards, reveals that they believe historical human achievements were made with the aid of a benevolent alien named Dagon. While Julie is enthusiastic about the Circle's charitable aims and efforts to advance technology to aid the less fortunate, Ben laughs at their superstitious worldview, resulting in a confrontation with Julie. Suspicious of the Circle, Ben sneaks into their building at night and discovers to his shock that they are holding Vilgax within. Vilgax explains that he survived their previous confrontation and was mistaken by the Circle for Dagon due to their resemblance. The Circle and Edwards confront Ben, with Julie intervening; Ben reveals the truth about Vilgax, and Julie turns against Edwards. Gwen and Kevin arrive, and the four of them are driven out by Edwards; Ben resolves to soon return and finally defeat Vilgax for good."
    },
    {
        "title": "Double or Nothing",
        "stream_url": "https://www.luxubu.review/v/7zv-n073329",
        "description": "Ben discovers the existence of a live show called Ben 10 Live in which the real Ben Tennyson supposedly appears in on-stage performances. Ben, Gwen, and Kevin travel to a Ben 10 Live show at Nemesis Tower, where they witness a seemingly identical version of Ben transforming into lifelike aliens. Ben and Gwen are outraged over their portrayal in the show and confront the producer, who is revealed to be Albedo; after their previous confrontation, Albedo chose to profit off of Ben's fame by hiring alien actors to perform in the show and deceive audiences across the country. Albedo reluctantly agrees to end the live show; however, one of his actors, a Vaxasaurian named Hugh, claims that Albedo has in fact been saving money and gathering parts to build a doomsday bomb that will make everyone on Earth look like Ben. Ben confronts Albedo, but Albedo's device activates, and Albedo reverts to his original Galvan form; he reveals that this was his true intent all along - he is now able to alter his DNA at will. However, because Ben interfered with the process, Albedo is still doomed to always turn back into Ben. Hugh admits that he made up the doomsday bomb story in the hopes of keeping Albedo on Earth as his friend; Albedo forgives Hugh but attacks Ben, who defeats him. Hugh promises to take care of Albedo, and takes him away."
    },
    {
        "title": "The Perfect Girlfriend",
        "stream_url": "https://www.luxubu.review/v/zyonz37668o",
        "description": "Ben takes Julie to the airport so she can fly to a tennis tournament, but leaves prematurely in order to defeat Ssserpent, resulting in another argument between the two of them. Ben is captured by Ssserpent, but Julie suddenly appears and rescues him, revealing that she chose not to go to the tournament and instead wishes to stay with Ben. Gwen and Kevin grow suspicious of Julie's one-sided and affectionate behavior toward Ben, especially after Gwen is mysteriously injured when she falls down an elevator shaft. Kevin stalks Julie to investigate and is suddenly attacked by huge, animated buildings, but is rescued by Ben as Way Big. Ben, realizing that Julie is not who she says she is, invites her to his house and then turns on the TV, revealing a rerun of Julie playing in the tennis tournament. Ben deduces that the real Julie is at the tournament, and the other Julie reveals herself as Elena Validus in disguise. Elena insists that she wants to be with Ben and get rid of anyone who stands between them. At that moment, Julie arrives suddenly, and Elena attacks Ben. Julie convinces Elena not to kill Ben, but Elena declares that she now knows what hate is, and vows revenge as she leaves."
    },
    {
        "title": "The Ultimate Sacrifice",
        "stream_url": "https://www.luxubu.review/v/7yvw0md66xo",
        "description": "During a battle, Ben transforms into Ultimate Humungousaur and suddenly declares that he is not Ben, attacking Gwen and Kevin. The two subdue him and consult a psychologist about his behavior, who deduces that he is suffering from some kind of split personality disorder. Ben screams and vanishes in a flash of light, leaving only the deactivated Ultimatrix, which Gwen realizes Ben is trapped inside of. Gwen and Kevin are divided on how to rescue him; Gwen uses an astral projection to enter the Ulimatrix, while Kevin travels to Galvan Prime to seek the aid of Azmuth. Kevin reaches Galvan Prime and battles a Galvanic Mechamorph security system, yelling at Azmuth that Ben is a hero and his best friend. Azmuth, moved by Kevin's growth and maturity, agrees to help him. Inside of the Ulimtatrix, Ben encounters his ultimate forms, which claim that they possess their own lives and minds, and wish to kill Ben in order to free themselves from him. Gwen arrives and saves Ben from the ultimates, and the two pursue them to a fiery pit, which the ultimates demand Ben jump into in order to liberate them. Gwen threatens to destroy the ultimates, but Ben tells her to stand down, and realizes he must sacrifice himself so that the ultimates may live. Ben kisses Gwen and hurls himself into the fire; he regains consciousness outside of the Omnitrix, where Azmuth, Kevin, Gwen, and the ultimates await. Azmuth reveals that he has repaired the glitch that granted the ultimates erroneous sentience, and says that the Ultimatrix recognized Ben's sacrifice and freed both him and the ultimates. Azmuth agrees to take the ultimates to a planet where they can live in peace, and Kevin offers to buy food for his \"best girl\" and his \"best friend.\""
    },
    {
        "title": "The Widening Gyre",
        "stream_url": "https://www.luxubu.review/v/mz9k32n501v",
        "description": "Colonel Rozum requests the aid of Ben and his team investigating the disappearance of Rozum's sister and two secret agents in the Great Pacific garbage patch. Arriving at an island of trash, Ben and the team confront mutated seagulls and monsters made of trash. Encountering the agents, they learn that the world governments attempted to destroy the garbage vortex by firing an experimental, plastic-eating bacteria at it; instead of destroying the vortex, however, the garbage achieved sentience and began capturing ships. The garbage monster reveals it is sentient, and begins moving to San Francisco. Ben turns into Way Big and defeats the garbage monster by throwing it into the sun, but the vortex still remains out in the Pacific."
    },
    {
        "title": "The Mother of All Vreedles",
        "stream_url": "https://www.luxubu.review/v/409xm20l8yv",
        "description": "Ma Vreedle, the mother of the Vreedle Brothers, arrives on Earth seeking to use Earth's oceans to fuel a device that will create billions of clones of her son, \"Pretty Boy\" Vreedle. Ben and the team confront them, with Ben questioning the allegiances of the Vreedle Brothers since they were originally going to become Plumbers. Eventually, the Vreedle brothers turn against Ma Vreedle and help Ben and the team arrest her."
    },
    {
        "title": "A Knight to Remember",
        "stream_url": "https://www.luxubu.review/v/8x9p65rjzqo",
        "description": "Ben, Gwen, Kevin, and a squadron of Plumbers confront the Flame Keeper's Circle, who are transporting Vilgax via truck. The Plumbers are defeated by the Esoterica, the soldiers of the Circle, and Conduit Edwards escapes with Vilgax. Ben and the team unmask one of the captured Esoterica, who is revealed to be Winston, the Forever Knight squire who was controlled by the Lucubra. Ben and the others confront Driscoll; they deduce that Dagon is real and exists in the other dimension where the Lucubra was from, and can now control anyone the Lucubra controlled at will. Dagon possesses Gwen and reveals that Vilgax is seeking his heart, which George cut out of him centuries ago, which will grant Vilgax limitless power. Driscoll reveals that hundreds of years ago, George fought Dagon and sealed him away, the origin of the myth of Saint George and the Dragon. George is still alive in the present day, possessing immortality, and has left the Forever Knights in order to retrieve his sword, which is buried in Dagon's heart. Gwen deduces where the sword is located, and Driscoll betrays them, then takes Winston and the other knights to the sword's location. At the location, a battle breaks out between the Forever Knights and the Esoterica, and Vilgax absorbs the power from George's sword and Dagon's heart. Dagon, possessing Winston, convinces Vilgax to break the seal; when Vilgax attacks the seal, Dagon absorbs him into his dimension, leaving the sword behind. George picks up the sword and his youth is instantly restored."
    },
    {
        "title": "Solitary Alignment",
        "stream_url": "https://www.luxubu.review/v/dwvr50dw2p9",
        "description": "Following the previous episode, George is suddenly confronted by Azmuth, who reveals that he built his sword, Ascalon. George leaves for Area 51, which he relocated and converted into a Forever Knight fortress, declaring that he will stop the Dagon. Azmuth then uses a simulation to tell Ben, Gwen, and Kevin the origins of Ascalon. Centuries ago, Azmuth and his lover Zennith lived on Primus, where Azmuth was seeking to understand the fundamental forces of the universe. Azmuth ultimately developed Ascalon to manipulate reality itself, but Zennith left him out of disagreement with his irresponsible behavior. Later, an Incursean stole Ascalon seeking to use it for battle, but instead accidentally destroyed his entire home planet. Azmuth retrieved Ascalon and swore to devote himself to peace. He then gave the sword to George in the year 1131 for him to use to defeat Dagon. Azmuth then admits that he developed the Omnitrix not only for the purpose of galactic peace and empathy, but also in the hopes that Zennith would notice."
    },
    {
        "title": "Inspector 13",
        "stream_url": "https://www.luxubu.review/v/7qo7nqy3gw9",
        "description": "Techadon weapon master Inspector 13 kidnaps Ben in order to investigate the failure of the Techadon robots to kill Ben in \"Greetings from Techadon.\" Gwen and Kevin attempt to rescue him, but a malfunction in the Omnitrix causes them to turn into Ben's alien forms. As Ben is captured in the Techadon factory, Gwen and Kevin are able to infiltrate it, and together they fix the Omnitrix and defeat Inspector 13."
    },
    {
        "title": "The Enemy of My Frenemy",
        "stream_url": "https://www.luxubu.review/v/8g9dedq0npv",
        "description": "Gwen has been repeatedly sneaking into Hex's library seeking a means of returning to Ledgerdomain to rescue Charmcaster. Hex confronts Gwen, but after hearing what Charmcaster did, he becomes deponent and believes Charmcaster is already dead. Gwen discovers that Ledgerdomain's true name is constantly changing, but develops an algorithm to deduce it and is able to open the Door to Anywhere, and she, Ben, and Kevin enter in search of Charmcaster. They discover that Addwaitya's rule fell after the Alpha Rune was stolen by Aggregor, but now a new, unknown tyrant rules in his place. Discovering Addwaitya at the mercy of a magical rune, Ben and the team free him, and he leads them to the usurper - revealed to be Charmcaster herself. Charmcaster kills Addwaitya and reveals to the group that she plans to use a mystical device to kill every living thing in Ledgerdomain as part of a ritual to resurrect her father. The team battles her, but Ben is destroyed in attempting to absorb the device, and Charmcaster subsequently kills Kevin and Gwen. Charmcaster uses the ritual to open a portal and speaks to Dagon, who resurrects her father, Spellbinder. When he learns of her actions, however, Spellbinder is horrified at her evil and chooses to return to the world of the dead, thus resurrecting all of the individuals Charmcaster killed. Ben and the team leave a heartbroken Charmcaster behind and exit Ledgerdomain, with Gwen and Kevin wondering how she will recover from losing the one thing she spent her whole life chasing after."
    },
    {
        "title": "Couples Retreat",
        "stream_url": "https://www.luxubu.review/v/7y9w0mdy1xv",
        "description": "Michael Morningstar steals a spell from Gwen's spellbook and summons the Door to Anywhere, transporting himself to Ledgerdomain, where he encounters Charmcaster. Charmcaster becomes infatuated with him, while Michael discovers that he has limitless power when in her presence. Over subjective weeks, Charmcaster falls in love with Michael and ultimately reveals her true name to him: \"Hope.\" Ben and the team are able to enter Ledgerdomain and confront the duo; while Michael attacks Ben and Kevin, Gwen attempts to convince Charmcaster of Michael's evil. Insulted after hearing Michael address Gwen as \"lovely Gwen,\" Charmcaster confronts him, and demands that he say her name. Michael calls her \"Heather,\" and Charmcaster, realizing his true nature, screams and banishes him and the others from Ledgerdomain. While a desperate Michael begs to be let back in, Ben, Kevin, and Gwen prepare to attack him again."
    },
    {
        "title": "Catch a Falling Star",
        "stream_url": "https://www.luxubu.review/v/40oxm20lky9",
        "description": "Jennifer Nocturne aids Carl Nesmith in escaping from prison. Ben and Gwen pursue them across the country, with Ben believing Nesmith has kidnapped her, while Gwen suspecting she is an accomplice. They track down Jennifer's mother, who reveals that Jennifer's father abandoned her before she was born, and Jennifer herself left for a TV show at the age of 14 and never returned. Meanwhile, Nesmith, seeking to hide his identity from the police, meets with a veterinarian who gives him plastic surgery; Nesmith subsequently murders him, as well as a random driver. Gwen deduces that Jennifer is suffering from Stockholm syndrome and has begun to identify with Nesmith due to her feelings that her old life was empty and meaningless. Nesmith leaves a note with the murdered driver telling Ben to meet him at Nemesis Tower; at the tower, Ben confronts and defeats Nesmith, but Jennifer uses one of Nesmith's battle suits to attack him. Gwen then defeats Jennifer; Nesmith insists to Jennifer that she tell the police he kidnapped her so that she won't be arrested for his crimes."
    },
    {
        "title": "The Eggman Cometh",
        "stream_url": "https://www.luxubu.review/v/7qv7nqy3pwo",
        "description": "Dr. Animo is unexpectedly paroled from prison and starts up a company selling eggs, which in fact contain mutant dinosaurs which he wishes to distribute around the world."
    },
    {
        "title": "Night of the Living Nightmare",
        "stream_url": "https://www.luxubu.review/v/8godedq0jp9",
        "description": "Ben wakes up in the middle of the night and is attacked by a jellyfish-like alien. After destroying it, he finds his parents and everyone in the neighborhood missing; he is then attacked by a DNAlien, but defeats it. Ben seeks out Kevin and Gwen, but they are also missing. Eventually, Ben encounters Vilgax, who is mysteriously silent as he attacks Ben. Ben defeats Vilgax, but he vanishes. Ben goes to Julie's house, but she uses Ship to attack him, then vanishes as well. Throughout the night, Ben is continuously attacked by his former foes, eventually deducing that he is trapped in some kind of dream world where all of his worst enemies are after him. Gwen and Kevin eventually find Ben, but express anger at Ben getting all of the power and never suffering like they have. Kevin absorbs the Ultimatrix and Gwen turns into her full Anodite form, but Ben defeats them both, and deduces that Gwen is actually a disguised Albedo. Albedo and Ben battle, but Ben, realizing that it's all a dream, is able to defeat all of Albedo's transformations with ease. Albedo attempts to use the jellyfish alien, a Cassiopeian dream eater, to return Ben to the nightmare's control, but slips on a spilled smoothie and drops it on his own face. The episode then cuts to Ben's room, where it is revealed that Albedo intended to attach the dream eater to Ben, but slipped on Ben's spilled smoothie and it attached to him; the entirety of the episode's events took place in Albedo's dream, not Ben's. As Ben, Gwen, and Kevin wonder what Albedo is dreaming, inside of the dream, Albedo is attacked by an army of Ben's aliens."
    },
    {
        "title": "The Beginning of the End",
        "stream_url": "https://www.luxubu.review/v/4d9jzew5lyv",
        "description": "Ben, Gwen, and Kevin are attacked by a group of Esoterica at Kevin's garage, but defeat them. Determining that George has had enough time to stop Dagon, the trio investigates the headquarters of the Flame Keeper's Circle, finding that they have all left to free Dagon from the seal. At the location of the seal, they find the Circle and the Forever Knights locked in an enormous battle; when they land, both the Esoterica and the Knights turn against them. Meanwhile, George and Winston enter the cave where the seal is located, but are attacked by Conduit Edwards, who fires an energy bolt at George; Winston takes the hit and dies, and George kills Edwards. At the seal, Dagon unleashes his \"herald\" upon George, revealed to be Vilgax, who has been infused with a Lucubra and become Dagon's servant. Just as Ben arrives, Vilgax breaks open the seal, revealing a tunnel leading to Dagon's dimension, though Dagon himself is still trapped in the seal. Meanwhile, most of the Forever Knights are killed in the battle against the Esoterica, including Patrick, Urian, and Driscoll."
    },
    {
        "title": "The Ultimate Enemy: Part 1",
        "stream_url": "https://www.luxubu.review/v/7y9w0mdypxv",
        "description": "Ben and the team continue to fight Vilgax, but he damages the seal enough for Dagon to send out an energy wave that converts everyone on Earth - apart from the shielded Ben, Gwen, Kevin, and George, as well as Julie and Ship - into mind-controlled Esoterica slaves. As Gwen and Kevin rush off to find a spell to contain Dagon, Ben and George battle Vilgax within Dagon's dimension, who continues his attempts to break Dagon's seal. At Gwen's house, Gwen and Kevin are assaulted by hordes of Esoterica until Dagon seizes control of Gwen's mind, bringing her back to the seal, with Kevin in pursuit. At the cave, Dagon orders Gwen to use her powers to destroy the seal, but Kevin breaks Dagon's hold on her by melding a metallic cap around her head that blocks out Dagon's mind control. Ben asserts that Vilgax isn't truly Dagon's servant and is only seeking to further his own gain; this is proven when Psyphon arrives in a spaceship, on Vilgax's orders. The group prepares for another battle, but at that moment, the seal suddenly shakes and collapses, though Dagon does not appear. Suddenly Dagon's booming voice echoes through the cave, saying \"I am everywhere.\" Looking through the hole in the cave, the group is horrified to see that Dagon has finally arrived, in the form of a gargantuan monster spanning the entire sky."
    },
    {
        "title": "The Ultimate Enemy: Part 2",
        "stream_url": "https://www.luxubu.review/v/8g9z63-lmyv",
        "description": "Ben transforms into Ultimate Way Big and attacks Dagon, but is defeated and nearly killed by Dagon's nigh-omnipotent power. Subsequently, Dagon electrocutes and disintegrates George with lightning, declaring himself victorious over his greatest foe. Vilgax suddenly appears and taunts Dagon into firing a laser at him, which Psyphon absorbs into the machine that Vilgax used to steal the powers of other heroes in Ben 10: Alien Force. Because Dagon's \"substance is power,\" his entire body is absorbed into the machine, which Vilgax orders Psyphon to fire at him in order to grant him Dagon's power. Psyphon does so in spite of Ben's objections, and Vilgax gains the full power of Dagon, attacking and seemingly destroying Ben, Gwen, and Kevin. However, Gwen is revealed to have teleported them all at the last second to the decommissioned Plumber headquarters at Mount Rushmore. Moments later, Vilgax returns and attacks them, knocking out Kevin and Gwen. Ben takes Ascalon and wields its power, attacking Vilgax and absorbing Dagon's power from him. Ben is tempted by the virtually limitless power he now possesses, and on Vilgax's suggestion, contemplates wiping out all evil in the galaxy. However, Gwen, Kevin, and a recently arrived Julie dissuade him, and Ben gives up the power. Julie kisses Ben, and Azmuth arrives to reclaim Ascalon. Azmuth then destroys the Ultimatrix and gives Ben a new Omnitrix, asking him to keep doing the right thing."
    }
]