[
    {
        "title": "And Then There Were 10",
        "stream_url": "https://www.luxubu.review/v/3q917p7lz29",
        "description": "Ben Tennyson, a 10-year- begins his cross-country summer vacation with his cousin, Gwen, and his grandpa, Max. Ben finds the crashed pod at their first stop. Within it is a watch-like alien artifact which is called the Omnitrix. When he reaches to touch it, the watch jumps onto his wrist and refuses to come off, unwillingly merging with his DNA. Ben accidentally discovers that it can change his form into various alien creatures and quickly learns how to use it. Deciding that he could be a superhero who can actually help people, Ben uses the watch to destroy robots sent by Vilgax to retrieve it, thus beginning a summer of adventure for himself, Max and Gwen."
    },
    {
        "title": "Washington B.C.",
        "stream_url": "https://www.luxubu.review/v/5jo4xkxe6xv",
        "description": "During a trip to Washington D.C., Ben confronts Dr. Animo, a disgruntled scientist whose Transmodulator can mutate living animals, and even resurrect dead ones, and eventually learns a lesson about what being a hero really means."
    },
    {
        "title": "The Krakken",
        "stream_url": "https://www.luxubu.review/v/pm95pmpl58o",
        "description": "When Ben has an encounter with a lake monster called the Krakken while swimming in a lake. A part of the summer vacation involves a fishing trip, where they charter Captain Shaw's boat for the trip. However, Shaw has seen the Krakken times before, and is obsessed with catching it. Ben, with Gwen's help, soon finds out that the creature is upset because Jonah Melville a poacher in the disguise of an animal lover, is stealing the creature's eggs. After Ben retrieves the eggs, a close scene is shown with the Krakken cuddling her regained eggs in her nest."
    },
    {
        "title": "Permanent Retirement",
        "stream_url": "https://www.luxubu.review/v/40vxm2mn7yo",
        "description": "Ben and Max visit a retirement center to visit their Aunt Vera, but find out that evil shapeshifting aliens called the Limax are kidnapping the residents to eat them later and taking their form to replace them."
    },
    {
        "title": "Hunted",
        "stream_url": "https://www.luxubu.review/v/549yp4pelx9",
        "description": "After Ben passes an obstacle course set up in the by Max, the Rustbucket breaks down outside the ghost town of Slatterville, New Mexico. Meanwhile, Vilgax hires three bounty hunters - Kraab, Sixsix, and Tetrax Shard - to retrieve the Omnitrix. Ben fights Tetrax, who reveals himself to be a Petrosapien. Tetrax criticizes his lack of strategy in hand-to-hand combat, then aids Ben in warding off Kraab and Sixsix. Realizing that Ben took his words to heart, Tetrax decides to leave him with the Omnitrix and awards him with a hoverboard."
    },
    {
        "title": "Tourist Trap",
        "stream_url": "https://www.luxubu.review/v/4l900l0x4x9",
        "description": "While in a tourist trap town called Sparksville, Ben plays a practical joke that accidentally unleashes several small electric creatures called Megawhatts. Ben must stop them from multiplying out of control and destroying the town, and eventually defeats them by sealing them inside a large fishbowl."
    },
    {
        "title": "Kevin 11",
        "stream_url": "https://www.luxubu.review/v/2w9m7k73ql9",
        "description": "Straying from Max after an argument for sneaking into the new Sumo Slammer game at a hotel in New York City, Ben meets and befriends Kevin Levin, an 11-year-old juvenile delinquent who can absorb energy. Their first misadventure forces Ben to reveal what the Omnitrix is capable of. Kevin suggests that they team up, but he just wants the Omnitrix's power for take revenge on those who treated him like a monster. The two fight and Ben chases Kevin off, but Kevin has absorbed some of the Omnitrix's energy."
    },
    {
        "title": "The Alliance",
        "stream_url": "https://www.luxubu.review/v/4lo00l0xgxo",
        "description": "While visiting Albuquerque, Four Arms reluctantly fights a female thief named Rojo, who injures Max. Ben realizes that the Omnitrix makes him a constant target and puts Gwen and Max in danger, but when he encounters Rojo again, this time telepathically controlled by Vilgax's robots, Max's advice helps Ben win. Vilgax makes telepathic contact with Ben during the battle and threatens him, claiming that he will obtain the Omnitrix some day."
    },
    {
        "title": "Last Laugh",
        "stream_url": "https://www.luxubu.review/v/54oyp4pe7xo",
        "description": "While visiting a travelling circus, Ben fights an evil clown named Zombozo who is draining people's souls through their laughter. Conquering his own fear of clowns, Ben defeats Zombozo by terrifying him as Ghostfreak and saves his family. Ben admits that he scares himself while fighting as Ghostfreak."
    },
    {
        "title": "Lucky Girl",
        "stream_url": "https://www.luxubu.review/v/1xoqq7qdwxo",
        "description": "During a trip to New Orleans, Ben prevents a powerful sorcerer named Hex from stealing the Arkamada Book of Spells. During the fight, Ben obtains one of Hex's five magical Charms of Bezel and gives it to Gwen, giving her the ability ro manpiulate luck. Using a Mardi Gras costume, Gwen becomes a superheroine named \"Lucky Girl\" and steals Ben's spotlight. Hex lures Gwen into a trap to retrieve the charm and destroy New Orleans, but Gwen smashes the Charms to prevent them from being used for evil."
    },
    {
        "title": "A Small Problem",
        "stream_url": "https://www.luxubu.review/v/8godedey7p9",
        "description": "In a fit of stubbornness, the Omnitrix transforms Ben into Grey Matter and leaves him stuck in that form for longer than normal. During this time, he is captured by Howell Wayneright, an alien-obsessed nerd whom then gets himself and Gray Matter captured by a secret society of knights known as the Forever Knights. The two work together to escape and discover a room filled with extraterrestrial technology, with which the Forever Knights could take over the world. Grey Matter causes three of the objects to trigger an explosion and destroy the Forever Knight's base. Enoch, the Forever Knight's leader, orders his men to find information on the Tennysons!"
    },
    {
        "title": "Side Effects",
        "stream_url": "https://www.luxubu.review/v/p6og7w7pgxo",
        "description": "Clancy, a man who can control insects, wants to take revenge on Councilwoman Liang because she wants to tear down the building where he and his insects live. Meanwhile, Ben has to deal with the strange side effects a cold has on his alien forms: Wildmutt is unable to see or smell, Four Arms smells horrible, and Heatblast's fire powers change to cryokinetic powers, which Ben uses to defeat Clancy."
    },
    {
        "title": "Secrets",
        "stream_url": "https://www.luxubu.review/v/zyvnz3z4m8v",
        "description": "With his wounds finally healed, Vilgax decides to personally retrieve the Omnitrix. He contacts Ben in a dream, which worries Max. Ben ignores Max's warnings not to use the Omnitrix and flies off to Rapid City, where Vilgax captures Ben and brings him aboard his spaceship. Max retrieves weapons from a secret base in Mount Rushmore, and he and Gwen free Ben, but are then held hostage. Max reveals that he activated the ship's self-destruct, and the three escape, leaving Vilgax on the ship as it explodes."
    },
    {
        "title": "Truth",
        "stream_url": "https://www.luxubu.review/v/7z9-n0n-x2o",
        "description": "Shortly after the events of \"Secrets\", Max tells Ben and Gwen about his secret past; he was a deputized agent of \"the Plumbers\", a secret government organization that dealt with extraterrestrial phenomenon, which was disbanded after Max defeated Vilgax himself for the first time. They run into Max's old partner, Phil Billings, who is still hunting aliens, though he is now a freelance agent. The frequency of the alien attacks and the familiar aliens raises Max's suspicions, and he heads to Mount Rushmore, where he finds the Null Void Projector — a weapon that can trap others in an alternate dimension — has gone missing. Phil has been abusing it to scam various hotel owners into paying him to remove the aliens that he sets free."
    },
    {
        "title": "The Big Tick",
        "stream_url": "https://www.luxubu.review/v/05ol1k1w-n9",
        "description": "During a trip to Yellowstone National Park, Ben discovers the eleventh alien on the Omnitrix, Cannonbolt. At the same time, a meteor crashes nearby, unleashing a giant tick-like alien called the \"Great One\" that intends to devour Earth. The Great One turns out to be impervious to Ben's original ten aliens, but Ben quickly discovers that Cannonbolt is impervious from any attack when rolled into an armored ball and penetrates the Great One's armor in that form, killing the alien from the inside."
    },
    {
        "title": "Framed",
        "stream_url": "https://www.luxubu.review/v/4lo00l0rpxo",
        "description": "During a trip to San Francisco, the Tennysons discover that doppelgangers of Ben's aliens are committing crimes around the city. Ben encounters the imposter and discovers that it was really Kevin; their last battle has given Kevin the ability to transform into the various aliens of the Omnitrix. Kevin leaves Ben to pay for his own crimes performed as Omnitrix aliens, bringing Ben into direct conflict with the cold and calculating Lt. Steel of the government's Special Alien Capture Team (SACT). Four Arms and Steel confront Kevin atop the Golden Gate Bridge, where Kevin's rage causes him to transform into a hybrid of all of the Omnitrix aliens without the ability to revert back to human form."
    },
    {
        "title": "Gwen 10",
        "stream_url": "https://www.luxubu.review/v/05ol1k1wzn9",
        "description": "When Ben wakes up one morning, he finds the Omnitrix missing from his arm and Gwen and Grandpa Max have no idea what he's talking about when he asks about it. Ben soon discovers that he is reliving the day he found the Omnitrix, but in an alternate reality. At the campsite, Ben tries to find the Omnitrix as it crashes to Earth, only to find out that Gwen has already found it. Gwen quickly adjusts to the Omnitrix's powers, but uses the Omnitrix much more than required and when Vilgax attacks, she finds the Omnitrix is discharged and will take some time before it becomes usable."
    },
    {
        "title": "Grudge Match",
        "stream_url": "https://www.luxubu.review/v/8godedepmp9",
        "description": "While Diamondhead battles Kevin, who had rendered Gwen and Max unconscious, a teleportation beam takes Diamondhead and Kevin to a ship called the Megacruiser, where gladiator matches are regularly held between alien slaves. Slix Vigma, the ship's droid captain, makes Ben and Kevin a team, bonding them with shackles that transfer pain from one to the other, so they battle another captive, Technorg. After the fight, Kevin traps Ben with the intent to kill, revealing that he still bears a grudge, but Ben transforms into Cannonbolt and knocks him out. Technorg abides by a code of honor and saves Ben, sending him back to Earth, while Kevin is left aboard the Megacruiser with Technorg."
    },
    {
        "title": "The Galactic Enforcers",
        "stream_url": "https://www.luxubu.review/v/4d9jzezr1yv",
        "description": "When Sixsix and his new partner Vulkanus arrive in Pittsburgh in search of raw minerals to build a devastating bomb, Ben joins a group of alien super heroes, the Galactic Enforcers, to stop them. However, all is not well with the new group, as a small gift of Ben's chocolate weakens the group's leader, Ultimos, which causes his second, Synaptak, to take the lead in order to try showing Ben up. However, the Enforcers' tactics involving 'commanding presence' backfire on them, and nearly getting group member Tini hurt in the process. However, after Ben goads Synaptak into rescuing Tini from a landslide, Ben and the Enforcers put aside their differences to arrest the bounty hunters."
    },
    {
        "title": "Camp Fear",
        "stream_url": "https://www.luxubu.review/v/1lo61l1e5l9",
        "description": "Distracted by Ben and Gwen quarreling, Max almost hits a young camper named Gilbert on the road. They take the boy back to his camp, Camp Opinicon, only to find no one there. As they investigate the premises, they find two more children, twins named Andy and Mandy, who are hiding from something that caused the camp to become deserted. Max is captured by tendrils while he investigates, prompting Ben and Gwen to split up. While Gwen leads the campers to safety from fungal mutants, Ben attempts two failed rescue missions, getting captured on the second. In trying to escape, Ben unlocks a new alien form, Wildvine."
    },
    {
        "title": "Ultimate Weapon",
        "stream_url": "https://www.luxubu.review/v/80oe5g5x77o",
        "description": "Max's Plumber equipment detects that an ancient mask had been unearthed in Texas. This quickly triggers a change in Max's attitude; he claims that this artifact would lead to the most powerful weapon ever designed, and that he should retrieve it before it falls into the wrong hands. Max immediately becomes more impatient, worse-tempered, and far stricter. Upon retrieving the mask, the Tennysons come into conflict with the Forever Knights, who want to find the weapon themselves. The Tennysons end up with the mask after a struggle and use it to find the Sword of Ekchuah, inside of a Mayan pyramid."
    },
    {
        "title": "Tough Luck",
        "stream_url": "https://www.luxubu.review/v/2w9m7k7wml9",
        "description": "Gwen dons her Lucky Girl costume again upon finding the mystical Keystone of Bezel at a convention in Las Vegas. Rather than good luck, the Keystone strengthens all of Gwen's natural abilities to superhuman levels and grants her superhuman agility, enhanced reflexes, and durability. At the same time, Hex is busted out of prison by his niece Charmcaster, and seeks to use the keystone to restore the destroyed charms."
    },
    {
        "title": "They Lurk Below",
        "stream_url": "https://www.luxubu.review/v/mzok323zk19",
        "description": "The family ride a jet belonging to Grandpa Max's old friend, Donovan GrandSmith, who owns an underwater resort in the Bermuda Triangle. At the entrance, they receive a warm welcome from Donovan himself, but also meet his grandson, Eddie, who doesn't seem to be excited about their guests. When Eddie, Ben, and Gwen enter the Undersea Manta Ray, a giant submarine, they encounter strange aliens that threaten to destroy the whole resort. While the kids find a way to cooperate with each other to find the source, the aliens want to retrieve as it turns out that it was a piece of their technology."
    },
    {
        "title": "Ghostfreaked Out",
        "stream_url": "https://www.luxubu.review/v/7qv7nqnexwo",
        "description": "Ben has been having strange nightmares about Ghostfreak. During a tour of an academy school Gwen wishes to attend, Ben sees and hears Ghostfreak everywhere. When Frightwig, Acid Breath, and Thumbskull show up, Ben activates his Omnitrix; however, it transforms him into Ghostfreak. After a vicious battle, Ghostfreak escapes from the Omnitrix. Ghostfreak removes his second layer of skin to possess Ben, and scares the circus trio into working for him as he schemes to possess Ben and gain control of the Omnitrix."
    },
    {
        "title": "Dr. Animo and the Mutant Ray",
        "stream_url": "https://www.luxubu.review/v/1lo61l1exl9",
        "description": "When Ben tries to dismantle the Omnitrix to see how it works, he ends up breaking off its faceplate, causing him to transform into hybrids of his alien forms. Meanwhile, Dr. Animo escapes from prison and, during a battle with Ben, finds the broken piece of the Omnitrix. Using it, he is able to complete his large-scale Transmodulator, giving him the power to mutate the entire planet in a single shot."
    },
    {
        "title": "Back with a Vengeance",
        "stream_url": "https://www.luxubu.review/v/pmo5pmped8v",
        "description": "During a trip to Niagara Falls, Ben accidentally unlocks the \"Master Control\" feature of the Omnitrix, allowing him to become any alien just by thinking about it at will. Elsewhere, Kevin has assumed control of the Megacruiser, and he locates and revives Vilgax, who realizes the nature of Kevin's mutation and decides that he may be of use. Kevin and Vilgax locate Ben and fight until Max attempts to trap the enemies in the Null Void dimension; however, Ben gets pulled in as well and ends up continuing his battle in another realm, so Gwen enters the Null Void in order to retrieve Ben."
    },
    {
        "title": "Ben 10,000",
        "stream_url": "https://www.luxubu.review/v/6mv2pmp54d9",
        "description": "As Ben and Gwen are planning Max’s birthday on the shore of Horse Thief Lake, a mysterious stranger appears and kidnaps her, so Ben follows her into a strange portal. When the dust settles, Ben realizes that he is twenty years in the future, where humans and aliens live peacefully. Ben then learns that Gwen's captor is her future self, who has become a master sorceress. Gwendolyn reveals that the future Ben, called Ben 10,000, is now a world-renowned hero with ten thousand different alien forms at his disposal. But, upon meeting his future self, Ben realizes that the future Ben is all business and just can't relax and have fun, not even for his own family."
    },
    {
        "title": "Midnight Madness",
        "stream_url": "https://www.luxubu.review/v/1xvqq7qeyxv",
        "description": "While visiting the Mega-mall-opolis in Bloomington, Minnesota, Ben and Gwen watch a hypnotist named Sublimino perform. Gwen volunteers Ben as a test subject, and Sublimino successfully hypnotizes him. When asked to act like an alien, Ben naturally turns to the Omnitrix and almost changes in front of the audience. Even though he is stopped by Gwen, the trouble doesn't end there. Sublimino is able to use those he hypnotizes to commit crimes in their dream state, and Ben proves to be the perfect accomplice."
    },
    {
        "title": "A Change of Face",
        "stream_url": "https://www.luxubu.review/v/7zo-n0n1z2v",
        "description": "During a visit to Salem, Massachusetts, Charmcaster attacks in an attempt to magically switch bodies with Ben to attain the great powers of the Omnitrix, but Gwen interferes, causing Charmcaster to switch with her instead. Gwen is punched out by Charmcaster before she can explain anything, and is then arrested and sent to juvie. Charmcaster stays with Ben and Max and tries to cook up another body-transference spell but Gwen escapes from juvie and returns, convincing Ben of the truth before Charmcaster tries again. However, Charmcaster manages to swap their bodies once more, ending with Charmcaster in her true body while Gwen and Ben have switched."
    },
    {
        "title": "Merry Christmas",
        "stream_url": "https://www.luxubu.review/v/8goz636w7y9",
        "description": "The Tennysons come upon a bizarre Christmas village in Death Valley, run by a Christmas-obsessed man named Mr. Jingles, who thinks Grandpa Max is Santa Claus and proceeds to kidnap him. As Ben and Gwen explore, they learn about a strange curse on the village which froze it in time at Christmas in the 1930s and transformed its residents into elves. But when Ben delivers all the gifts that had been made, the curse is reversed, and time catches up to the village instantly."
    },
    {
        "title": "Benwolf",
        "stream_url": "https://www.luxubu.review/v/7q97nqnerwv",
        "description": "During a visit to a Navajo village owned by Max's old Plumber partner Wes Green in Chinle, Arizona, Ben falls in love with Wes' granddaughter Kai, while a wolf-like creature appears in a flash of purple lightning. Wes believes it to be a Yenaldooshi, or Navajo werewolf. It stole and ripped the receiver. Wildvine fights the creature, but it bites Wildvine's root just before Ben returns to normal. It nearly kills Ben, but he is spared when the wolf accidentally scratches the Omnitrix rather than Ben himself. Afterwards, Ben begins transforming into a werewolf himself, presumably an effect of the bite. However, the group discover that the werewolf is an alien, and added its DNA to the Omnitrix by scratching it, thus gradually transforming Ben into Blitzwolfer."
    },
    {
        "title": "Game Over",
        "stream_url": "https://www.luxubu.review/v/7qo7nqne8w9",
        "description": "Ben and Gwen are playing the Sumo Slammer video game and Gwen is beating Ben at it. Ben turns into Upgrade and merges with the computer so he can lower Gwen's score. As Gwen tries to get Ben out, lightning hits the van and zaps them both into the game. They realize that all of the aliens in the Omnitrix are unavailable and they have to collect tokens to activate certain ones. They progress through the levels to get the Upgrade token and allow them to leave the game, but the villain of the game hears them and wants to use the Upgrade token to leave the game and take over the real world."
    },
    {
        "title": "Super Alien Hero Buddy Adventures",
        "stream_url": "https://www.luxubu.review/v/1lo61l1ejl9",
        "description": "When a television show called Super Alien Hero Buddy Adventures shows up, Ben gets angry and demands credit since it stars cartoon versions of Fourarms, Heatblast, and Wildmutt. Furthermore, it has replaced his favorite show, Kangaroo Commando. It just so happens Ben and Gwen are visiting Planetary Studios in Hollywood at the time, so he tries to confront the producer about it. Meanwhile, strange accidents begin occurring around the actor who plays The Commando, allowing the actor to save the day. The Commando suspects that the artist producing the cartoon, Tim Dean, is responsible, but Gwen suspects foul play on the Commando's part."
    },
    {
        "title": "Under Wraps",
        "stream_url": "https://www.luxubu.review/v/7z9-n0n1r2o",
        "description": "To teach Ben and Gwen the value of hard work, Max takes them to a family farm owned farmer Joan Maplewood in Dairyville, South Carolina. During dinner there, Joan's son Todd tells Ben and Gwen of a mysterious mummy that had recently arrived in a flash of purple lightning that sparks their curiosity. The two of them find it digging for a strange stone, but it attacks them as soon as they see it. XLR8 fights it to no avail, but the alien mummy flees in the confusion. Max discovers that the strange rock is a mineral called \"Corrodium,\" which causes severe mutations in earthly organisms."
    },
    {
        "title": "The Unnaturals",
        "stream_url": "https://www.luxubu.review/v/pm95pmpnj8o",
        "description": "Ben goes to see his favorite Little League team. Unfortunately, Cash and JT are on his team, and he discovers that their opponents, the Squires, are robots. He cheats for his own team, but it works against them when the robots try to kidnap people on the team who appeared to be experts due to Ben's help. While attempting a rescue, Ben discovers that the robots plans are to replace the President of the United States, who had also been watching the game. After the Tennysons save the President and leave, Enoch appears, revealing the plan to be his own. He vows that the Tennysons will pay with their lives."
    },
    {
        "title": "Monster Weather",
        "stream_url": "https://www.luxubu.review/v/1xoqq7qnxxo",
        "description": "Grandpa Max takes Gwen and Ben to a music festival in Chicago to see his favorite old time band, Shag Carpeting, but the event is interrupted by a weather-controlling robot called S.A.M."
    },
    {
        "title": "The Return",
        "stream_url": "https://www.luxubu.review/v/54oyp4pr5xo",
        "description": "A shuttle launch at NASA is interrupted by a purple lightning storm, which attracts the attention of the Tennysons, who hope to discover the origin of the alien werewolf and mummy. While at NASA, Ben runs into an ill-tempered scientist named Dr. Viktor. Surveillance tapes associate him with the purple lightning storm, and he is quickly shown to be in cahoots with the two creatures. The Tennysons encounter the creatures again, in addition to Doctor Viktor; following a losing battle, they split up: Max and Gwen board the space shuttle that Viktor launches, and Ben as XLR8 follows Viktor, who revives his master and commander, who to Ben's horror is revealed to be Ghostfreak."
    },
    {
        "title": "Be Afraid of the Dark",
        "stream_url": "https://www.luxubu.review/v/dw9r505nxpo",
        "description": "Ben transforms into Grey Matter to escape from Ghostfreak and Viktor. He is able to discern Ghostfreak's plan from a computer terminal: using the corrodium to amplify the power source of the orbiting space station, in conjunction with the device the alien werewolf built in New Mexico, Ghostfreak is intent on covering the daylight side of the Earth in a corrodium shield. This will not only mutate Earth's population, but it will also block out the sun, giving Ghostfreak a world of eternal darkness to rule over. Ben uses Upgrade to create a makeshift rocket to get to the space station, which Viktor clings to so that he might also get to the station, while Max and Gwen fight the mummy aboard the space center and attempt to thwart Ghostfreak's plan from there."
    },
    {
        "title": "The Visitor",
        "stream_url": "https://www.luxubu.review/v/7qv7nqnwjwo",
        "description": "During a trip in St Louis, Ben and Gwen meet a female alien named Xylene, who locates the Omnitrix and confronts Ben under the impression that he had stolen it. But when Max comes to defend them, he and Xylene recognize each other as old comrades and sweethearts. The two reminisce later that night, and Xylene reveals that she was the commander of the ship bringing the Omnitrix to Earth when Vilgax attacked it, and that she had intended to send it to Max for safekeeping; Ben received the Omnitrix by mistake. But when one of Vilgax's remaining drones attacks and captures Max, Ben and Xylene reluctantly team up to save him, with Xylene unlocking Upchuck to defeat the drone."
    },
    {
        "title": "Perfect Day",
        "stream_url": "https://www.luxubu.review/v/059l1kke8nv",
        "description": "Ben seems to be having a perfect day, but eventually discovers that Enoch and the Forever Knights have trapped him in a dream world while they attempt to remove the Omnitrix from his wrist. Enoch then turns the dream into a nightmare, but Ben manages to take control of the dream and escape, trapping Enoch in his own dream world. Once the Tennysons leave, another Forever Knight, the \"Forever King\", decides to leave Enoch in the machine as punishment for his past failures."
    },
    {
        "title": "Divided We Stand",
        "stream_url": "https://www.luxubu.review/v/409xm22npyv",
        "description": "Dr. Animo has escaped from prison with the help of a mutated seagull, plotting to get revenge on Ben, who is at the beach with Gwen and Max. Ben is being impulsive as no one will play with him, until he is confronted by Animo's seagull. During the fight, Ben discovers a new alien on the Omnitrix, Ditto, who has the power to multiply at will. Ben manages to drive of the seagull and enjoys playing as his multiple Ditto copies. However, one of Ben's Ditto clones is captured by Animo himself in hopes of exploiting his alien DNA for his own evil purposes."
    },
    {
        "title": "Don't Drink the Water",
        "stream_url": "https://www.luxubu.review/v/809e5gg1m79",
        "description": "Growing weak with old age, Hex is seeking out something to make him stay young. At the same time, Max is having difficulties with his aging body, so he decides to impress his grandkids at a fair to show them he's not as elderly as he seems. At the dunking game Max challenged them to, he and Ben both get splashed, unaware that the water is from the Fountain of Youth. Max regresses into a ten-year-old while Ben becomes a four-year-old. Hex manages to force the booth's owner, Hector, into revealing the location of the fountain as he is its guardian, having been charged to do so by Juan Ponce de León four centuries ago."
    },
    {
        "title": "Big Fat Alien Wedding",
        "stream_url": "https://www.luxubu.review/v/2wvm7kk3glv",
        "description": "Ben, Gwen, and Grandpa Max attend a family wedding for Max's nephew Joel and his bride-to-be, Camille. Before the day of the wedding, Ben interrupts a mud alien's attempt to sabotage the wedding. Ben defeats the sludge alien as Cannonbolt but finds the groom's parents pointing rifles at him soon after. He escapes with Gwen's help, and Max explains that the groom's side of the family are all Plumbers, while the bride's side are all mud-like aliens, called \"Sludgepuppies\", which the Plumbers were sworn enemies with until Joel and Camille met and forged a romance, which makes the wedding a truce. However, during a dinner time with the families, they are confronted by Camille's ex-boyfriend."
    },
    {
        "title": "Ben 4 Good Buddy",
        "stream_url": "https://www.luxubu.review/v/1x9qq77d3x9",
        "description": "While traveling through a desert, the Tennysons' encounter a group of modern-day pirates called the Road Crew attempting to hijack the deluxe RV of Laurence Wainwright. After stopping the Road Crew, the family makes a pit stop and Ben and Gwen start to complain about how the Rust Bucket doesn't work right and isn't nearly as luxurious as Laurence's RV. Shortly afterwards, the Road Crew returns and steals the Rust Bucket. While Grandpa Max tries desperately to track down the Rust Bucket, the Road Crew give it a makeover for use in their plans."
    },
    {
        "title": "Ready to Rumble",
        "stream_url": "https://www.luxubu.review/v/3qv17ppl02v",
        "description": "After damaging Gwen's new laptop, Ben enters a wrestling competition as Four Arms to earn some money to replace it, becoming an instant celebrity. During the tournament, he fights a pair of mutant brothers who owe a mob boss a large sum of money to save their farm. They entered the competition to pay off their debt, which Ben doesn't learn about until after defeating them. After learning the truth, Ben goes with them to save their mother, who is being held by the gang as \"collateral damage\"."
    },
    {
        "title": "Ken 10",
        "stream_url": "https://www.luxubu.review/v/8x9p6557wqo",
        "description": "In an alternate future, Ben's son Kenny is celebrating his tenth birthday, and to commemorate the occasion Ben gives him an Omnitrix of his very own. Kenny soon befriends a boy named Devlin, and the same night Ben's old foe Kevin 11 attacks their home looking for the Null Void chamber. Unable to locate the chamber, he retreats. Kenny becomes angry at his father for not telling him or letting him fight Kevin and endeavors to find the chamber with Devlin. When they find it, Devlin mutates into Kevin's mutant form revealing he was the real attacker from the previous night, and activates the chamber, releasing the real Kevin, who is revealed to be Devlin's father and mutates into a new form, \"Kevin 11,000\"."
    },
    {
        "title": "Ben 10 vs. The Negative 10: Part 1",
        "stream_url": "https://www.luxubu.review/v/7y9w0mmzxxv",
        "description": "The Tennysons pick up the grandson of another Plumber, Cooper Daniels, who is hitching a ride home with them. Meanwhile, a Plumber base within the bullion depository at Fort Knox is robbed by the Circus Freaks and Sublimino. By the time the Tennysons find out, they are too late to help. They soon learn of a second robbery at a Plumber base on the top floors of the Seattle Space Needle, this time run by Rojo, Animo, Clancy, and Charmcaster. Max discovers that they are searching for the keys to the \"Sub Energy\", an extremely potent sub-atomic power source given to the Plumbers by an alien race. They lose the keys to the villains, and attempt to rout them at the Mount Rushmore base, where the Sub Energy is stored. However, they find that the Forever King, joined by a subordinate and the villains that raided the earlier bases, has beaten them to it."
    },
    {
        "title": "Ben 10 vs. The Negative 10: Part 2",
        "stream_url": "https://www.luxubu.review/v/4d9jzeekdyv",
        "description": "Ben, Gwen, Max, and Cooper, use the Plumbers' Mount Rushmore installation to mount a final stand against the Forever King's forces. Max discovers that the Forever King was once a plumber named Driscoll who was kicked out after hoarding alien technology. Despite their best efforts, they are unable to keep Driscoll from obtaining the Sub-Energy. Driscoll uses the sub-energy to tremendously increase his armored suit and battles Ben, who is able to use Upchuck to digest the power source and destroy it safely."
    },
    {
        "title": "Goodbye and Good Riddance",
        "stream_url": "https://www.luxubu.review/v/40oxm22n8y9",
        "description": "Ben returns home after the summer vacation ends and is told by Max that he must keep the Omnitrix a secret. Ben gets the chance to use the Omnitrix when Vilgax attacks, looking to take the device from Ben. All four Tennysons fight off Vilgax's drones running amok in the city. When Vilgax appears again, easily fending off Ben, Ben's father suggests leading him into the underground gas line, which they ignite to incinerate the villain. Ben's secret is revealed to the public during the affair, and Gwen ends up transferring to his school. Just when it seems like everything is quiet, Dr. Animo shows up with a group of mutated animals, which Ben and Gwen get ready to fight."
    }
]